{"slug":"2020-10-neu-dritte-auflage","html":"<p><strong>Das neue deutschsprachige Angular-Buch ist da!</strong>\nAb sofort ist die 3. Auflage des erfolgreichen Standardwerks im Handel verfügbar.</p>\n<p>Mit der neuen Ausgabe erwarten Sie 870 Seiten mit aktuellen Inhalten zum Webframework Angular.\nWir haben die neue Ausgabe grundlegend aktualisiert und erweitert.\nAlle Inhalte und Beispiele sind auf dem Stand der aktuellen Angular-Version 10 und wurden an etablierte Best Practices angepasst.\nDabei haben wir viele Teile des Buchs vollständig überarbeitet.</p>\n<p>Zusätzlich haben wir einige neue Themen in das Buch aufgenommen, sodass die neue Auflage etwa 120 Seiten stärker ist als die vorherige.\nIm <a href=\"/blog/2020-08-changelog-dritte-auflage\">Changelog zur dritten Auflage</a> erhalten Sie einen Überblick über die Änderungen und Erweiterungen.\nAuch für die Leser der ersten und zweiten Auflage lohnt sich der Umstieg.</p>\n<p>Das Buch ist zum Preis von 36,90 EUR in jeder gut sortierten Buchhandlung und im Online-Handel erhältlich – zum Beispiel direkt beim <a href=\"https://dpunkt.de/produkt/angular-4/\">dpunkt.verlag</a> oder bei <a href=\"https://amzn.to/30s4mVX\">Amazon</a>.</p>\n<div class=\"row\">\n  <div class=\"col-6\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7039.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-6\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7044.jpg\" alt=\"\">\n  </div>\n</div>\n\n<h2 id=\"fundierter-einstieg-in-angular\">Fundierter Einstieg in Angular</h2>\n<p>Lernen Sie Angular mit diesem Praxisbuch!</p>\n<p>Sie werden von Ferdinand Malcher, Johannes Hoppe und Danny Koppenhagen anhand eines <a href=\"https://book-monkey4.angular-buch.com/\">anspruchsvollen Beispielprojekts</a> durch die Welt von Angular geführt und entwickeln Schritt für Schritt Ihre erste modulare Single-Page-Anwendung.</p>\n<p>Praktisch: Der Programmcode zu jeder einzelnen Entwicklungsphase ist auf GitHub verfügbar.\nSo können Sie alle Schritte gut nachvollziehen und in Ihrem eigenen Tempo bearbeiten.</p>\n<p>Die Autoren sind erfahrene Workshopleiter, Entwickler und internationale Konferenzsprecher. Aufgrund ihres Engagements rund um das Buch und Angular wurden Ferdinand und Johannes als Google Developer Experts (GDE) ausgezeichnet.\nIn diesem praktischen Nachschlagewerk vermitteln sie die Best Practices aus ihrer täglichen Arbeit mit Angular.</p>\n<p>Aus dem Inhalt:</p>\n<ul>\n<li>Reaktive Programmierung mit RxJS</li>\n<li>State Management mit Redux und NgRx</li>\n<li>Testing mit Jasmine, Karma und Protractor</li>\n<li>Routing, Guards und Modulsystem</li>\n<li>HTTP und Interceptoren</li>\n<li>Formularverarbeitung</li>\n<li>Dependency Injection und Services</li>\n<li>Internationalisierung (i18n)</li>\n<li>Server-Side Rendering</li>\n<li>Progressive Web Apps (PWA) und NativeScript</li>\n</ul>\n<p>Das Buch setzt Vorkenntnisse in JavaScript, HTML und CSS voraus.\nWer nicht mit TypeScript vertraut ist, findet hier eine kompakte Einführung.</p>\n<div class=\"row\">\n  <div class=\"col-4\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7047.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7049.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7051.jpg\" alt=\"\">\n  </div>\n</div>\n\n<h2 id=\"hintergrund\">Hintergrund</h2>\n<p>Die zweite Auflage des deutschen Angular-Buchs aus dem dpunkt.verlag erschien vor einem Jahr, im Juni 2019, im Handel.\nMit einem IT-Buch befinden wir uns stets in einem Spannungsfeld:\nEinerseits ist ein gedrucktes Buch für Beständigkeit über mehrere Jahre ausgelegt, andererseits muss ein Enterprise-Framework wie Angular schnell beweglich sein, um mit dem technologischen Fortschritt mitzuhalten.</p>\n<p>Wir haben deshalb regelmäßig in <a href=\"/updates\">Blogartikeln</a> über neue Features und Änderungen informiert.\nDie zweite Auflage ist noch immer aktuell, aber wir haben die Gelegenheit genutzt, um viele optionale Baustellen anzugehen.\nWir haben vor allem Wert darauf gelegt, dass komplexe Themen verständlich vermittelt werden.\nDabei haben wir unsere tiefgreifende Erfahrung aus dem Alltag mit Projektarbeit, Beratung und Schulungen einfließen lassen.</p>\n<p>Im Januar 2020 haben wir den Entschluss zur dritten Auflage gefasst.\nDabei haben wir einen guten Kompromiss zwischen einer reinen Aktualisierung und einer vollständigen Neuauflage gefunden.\nDas Leser-Feedback zur zweiten Auflage haben wir berücksichtigt, und es wurden viele unklare Stellen des zweiten Buchs vereinfacht.\nDas neue Angular-Buch bewegt sich damit wieder am Puls der Zeit und sollte auch in zwei Jahren noch genug Aktualität besitzen.</p>\n<p>Wir wünschen Ihnen viel Spaß beim Lesen!\nSollten Sie Feedback, Anmerkungen oder Fragen haben, zögern Sie nicht, uns zu schreiben!\nWir sind per Mail unter <a href=\"mailto:team@angular-buch.com\">team@angular-buch.com</a> oder <a href=\"https://twitter.com/angular_buch\">Twitter</a> für Sie da.</p>\n<p>Mit besten Grüßen –\ndas Autorenteam<br>\n<strong>Ferdinand Malcher, Johannes Hoppe und Danny Koppenhagen</strong></p>\n<div class=\"row\">\n  <div class=\"col-6\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7055.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-6\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-10-neu-dritte-auflage/buch700/IMG_7053.jpg\" alt=\"\">\n  </div>\n</div>\n\n<h2 id=\"danksagung\">Danksagung</h2>\n<p>Dieses Buch hätte nicht seine Reife erreicht ohne die Hilfe und Unterstützung verschiedener Menschen.\nBesonderer Dank geht an <strong>Michael Kaaden</strong> für seine unermüdlichen Anregungen, kritischen Nachfragen und seine starke Unterstützung beim Kapitel zu Docker.\n<strong>Danilo Hoffmann</strong> und <strong>Jan-Niklas Wortmann</strong> danken wir ebenso für die hilfreichen Anregungen und Korrekturvorschläge.\nUnser Dank geht außerdem an <strong>Michael Hladky</strong> für wertvollen Input zur Change Detection und zur Bibliothek RxAngular.\nDarüber hinaus hat uns <strong>Nathan Walker</strong> mit seiner Zeit und Expertise beim Kapitel zu NativeScript unterstützt.</p>\n<p>Wir danken <strong>Gregor Woiwode</strong> für die Mitwirkung als Autor in der ersten Auflage.\nDem Team vom dpunkt.verlag, insbesondere <strong>René Schönfeldt</strong>, danken wir für die persönliche Unterstützung und die guten Anregungen zum Buch.\n<strong>Annette Schwarz</strong> danken wir für das gewissenhafte Korrektorat unseres Manuskripts.\nBesonderer Dank gilt dem <strong>Angular-Team</strong> und der Community dafür, dass sie eine großartige Plattform geschaffen haben, die uns den Entwickleralltag angenehmer macht.</p>\n<p>Viele Leser haben uns E-Mails mit persönlichem Feedback zum Buch zukommen lassen – vielen Dank für diese wertvollen Rückmeldungen.</p>\n<p><a class=\"btn btn-outline-primary cta__button index__cta mr-2 mb-2\" role=\"button\" target=\"_blank\" href=\"https://angular-buch.com/assets/angular-buch.com_leseprobe_3.auflage.pdf\">Kostenlose Leseprobe <img src=\"assets/img/symbol-cloud.svg\"></a>\n<a class=\"btn btn-primary cta__button mb-2\" role=\"button\" target=\"_blank\" href=\"https://amzn.to/30s4mVX\">3. Ausgabe jetzt bestellen</a></p>\n","meta":{"title":"3. Auflage: Das neue Angular-Buch ist da!","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2020-10-12T00:00:00.000Z","lastModified":"2020-10-12T00:00:00.000Z","keywords":["Angular","Buch","Release","Buchhandel","Dritte Auflage"],"language":"de","header":{"url":"buchblogheader3.png","width":2000,"height":697},"sticky":false,"hidden":false,"darkenHeader":false}}
