{"slug":"2020-11-angular11","html":"<p>Es hätte kein schöneres Datum sein können: am 11.11.2020 wurde die neue Major-Version <strong>Angular 11.0</strong> veröffentlicht – fünf Monate nach dem <a href=\"/blog/2020-06-angular10\">Release von Angular 10</a>.</p>\n<p>Wie üblich stellen wir Ihnen in diesem Artikel die wichtigsten Neuerungen vor.\nDas neue Major-Update bringt vor allem eine Menge Optimierungen und Stabilisierungen mit.\nGrund dafür ist die &quot;Operation Byelog&quot;, mit der sich das Angular-Team das Ziel gesetzt hat, einen Großteil der Issues auf GitHub zu kategorisieren und in den nächsten Monaten zu bearbeiten.</p>\n<p>Besonderer Fokus wurde in Angular 11.0 auf die Verbesserung des Toolings gelegt.\nDabei sind auch einige kleine Breaking Changes enthalten, die allerdings mithilfe der mitgelieferten Migrationsskripte und <code>ng update</code> leicht zu bewältigen sind.</p>\n<p>Die offizielle Ankündigung zum neuen Release mit allen Features finden Sie im <a href=\"https://blog.angular.io/version-11-of-angular-now-available-74721b7952f7\">Angular-Blog</a>.</p>\n<blockquote>\n<p><strong>Die Update-Infos für neuere Versionen von Angular finden Sie in separaten Blogartikeln. Wenn Sie das Update durchführen möchten, lesen Sie bitte alle Artikel in der gegebenen Reihenfolge.</strong></p>\n<ul>\n<li><a href=\"/blog/2021-06-angular12\">Angular 12 ist da!</a></li>\n<li><a href=\"/blog/2021-11-angular13\">Angular 13 ist da!</a></li>\n<li><a href=\"/blog/2022-06-angular14\">Angular 14 ist da!</a></li>\n<li><a href=\"/blog/2022-11-angular15\">Angular 15 ist da!</a></li>\n<li><a href=\"/blog/2023-05-angular16\">Angular 16 ist da!</a></li>\n</ul>\n</blockquote>\n<h2 id=\"update-auf-angular-11\">Update auf Angular 11</h2>\n<p>Das Update zur neuen Angular-Version sollte ohne viel Aufwand möglich sein.\nFühren Sie dazu die folgenden Befehle in Ihrem Projekt mit Angular 10 aus:</p>\n<pre><code class=\"language-bash\"><span class=\"hljs-attribute\">ng</span> update <span class=\"hljs-variable\">@angular</span>/cli <span class=\"hljs-variable\">@angular</span>/core\n</code></pre>\n<p>Im <em>Angular Update Guide</em> unter <a href=\"https://update.angular.io/#10.0:11.0\">update.angular.io</a> können Sie wie üblich alle Migrationsschritte im Detail nachvollziehen und die Migration vorbereiten.</p>\n<h2 id=\"verbesserte-log-ausgabe\">Verbesserte Log-Ausgabe</h2>\n<p>Unter anderem wurde die Log-Ausgabe auf der Konsole für die Befehle <code>ng serve</code> und <code>ng build</code> überarbeitet.\nWas zunächst nach einem rein kosmetischen Eingriff aussieht, ermöglicht einen verbesserten Überblick über die gebauten Bundles und ihre Größen.\nAuch die Gesamtgröße der gebauten Artefakte wird nun ausgegeben.</p>\n<p><img src=\"https://website-articles.angular-buch.com/2020-11-angular11/ngserve.png\" alt=\"Ausgabe für ng serve\"></p>\n<h2 id=\"async-wird-zu-waitforasync\"><code>async</code> wird zu <code>waitForAsync</code></h2>\n<p>Für Unit- und Integrationstests mit Karma (oder Jest) stellt Angular die Funktion <code>async()</code> zur Verfügung.\nDieser Funktionsname sorgte stets für Verwechslung mit dem nativen Schlüsselwort <code>async</code> und der AsyncPipe. Die Funktion wurde deshalb zu <code>waitForAsync()</code> umbenannt .</p>\n<pre><code class=\"language-ts\"><span class=\"hljs-keyword\">import</span> { waitForAsync } <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">&#x27;@angular/core/testing&#x27;</span>;\n\nit(<span class=\"hljs-string\">&#x27;should do X and Y&#x27;</span>, waitForAsync(<span class=\"hljs-function\"><span class=\"hljs-params\">()</span> =&gt;</span> {\n  <span class=\"hljs-built_in\">setTimeout</span>(<span class=\"hljs-function\"><span class=\"hljs-params\">()</span> =&gt;</span> {\n    expect(<span class=\"hljs-literal\">true</span>).toBeTruthy();\n  }, <span class=\"hljs-number\">500</span>);\n}));\n</code></pre>\n<h2 id=\"hot-module-reloading\">Hot Module Reloading</h2>\n<p>Der Entwicklungswebserver von <code>ng serve</code> unterstützt nun das sogenannte Hot Module Reloading (HMR). Dabei wird nach einer Code-Änderung nicht die komplette Seite neu geladen, sondern es werden nur die geänderten Bundles &quot;on the fly&quot; ausgetauscht.\nDadurch funktioniert das Neuladen noch schneller.\nUm HMR zu nutzen, kann die neue Option <code>--hmr</code> genutzt werden:</p>\n<pre><code class=\"language-bash\">ng serve <span class=\"hljs-comment\">--hmr</span>\n</code></pre>\n<h2 id=\"migration-zu-eslint\">Migration zu ESLint</h2>\n<p>Der TypeScript-Linter TSLint wird seit einiger Zeit nicht mehr weiterentwickelt und ist <a href=\"https://medium.com/palantir/tslint-in-2019-1a144c2317a9\">seit 2019 deprecated</a>. Es wird der Umstieg auf <a href=\"https://eslint.org/\">ESLint</a> empfohlen.\nIn einem neuen Projekt mit Angular 11 ist TSLint noch standardmäßig eingerichtet; ab Angular 12 soll auch diese Implementierung wegfallen, sodass kein Linter als Standard im Projekt eingerichtet ist.</p>\n<p>Das Communityprojekt <a href=\"https://github.com/angular-eslint/angular-eslint\">angular-eslint</a> wird nun vom Angular-Team offiziell empfohlen. Eine Anleitung zur Einrichtung finden Sie <a href=\"https://github.com/angular-eslint/angular-eslint#migrating-from-codelyzer-and-tslint\">in der Dokumentation</a>.</p>\n<h2 id=\"weitere-neuigkeiten\">Weitere Neuigkeiten</h2>\n<p>Wir haben bis hierhin nur die wichtigsten Neuerungen aufgeführt. Eine ausführliche Aufstellung aller Änderungen finden Sie im <a href=\"https://github.com/angular/angular/blob/master/CHANGELOG.md\">Changelog von Angular</a>.\nFolgende Punkte sind zusätzlich erwähnenswert:</p>\n<ul>\n<li><strong>Font Inlining:</strong> Ab Angular 11 werden eingebundene Google Fonts automatisch heruntergeladen und in die Anwendungsbundles übernommen. Das soll den &quot;First Contentful Paint&quot; verbessern.</li>\n<li><strong>Webpack 5:</strong> Die neue Version von Webpack wird experimentell unterstützt. Damit funktioniert auch die sogenannte <a href=\"https://webpack.js.org/concepts/module-federation/\">Module Federation</a>, um Bundles dynamisch von einer externen Quelle nachzuladen.</li>\n<li><strong>Language Service:</strong> Der Angular Language Service ermöglicht in der Entwicklungsumgebung eine inhaltliche Analyse des Codes, um z. B. Typprüfungen im Template anzubieten. Die aktuelle Implementierung basiert auf der alten &quot;View Engine&quot;. Derzeit wird an einer neuen Version gearbeitet, die den neuen Ivy-Compiler unterstützt. Das Modul kann bereits als Preview ausprobiert werden.</li>\n<li><strong>Verbesserung der Typisierung:</strong> Viele Teile des Frameworks wurden hinsichtlich ihrer Typisierung verbessert, z. B. einige Pipes. Das führt in der Theorie zu Breaking Changes, daher ist die Liste der Breaking Changes im aktuellen Changelog sehr lang. Für die meisten Projekte sollte es hier aber keine praktische Auswirkung geben. Idealerweise zeigen die neuen Prüfungen sogar bestehende Bugs im Projekt auf.</li>\n<li><strong>ng serve mit Fallback-Port:</strong> Ist der Port von <code>ng serve</code> bereits durch einen anderen Prozess belegt, wurde bisher ein Fehler ausgegeben. Mit der neuen Version bietet die Angular CLI an, automatisch einen anderen freien Port zu wählen.</li>\n</ul>\n<h2 id=\"angular-buch-in-der-3-auflage\">Angular-Buch in der 3. Auflage</h2>\n<p>Die 3. Auflage unseres deutschsprachigen Angular-Buchs erschien vor wenigen Wochen im Handel!\nDas Buch ist durchgängig auf dem Stand von Angular 10 und frühen Versionen von Angular 11, sodass Sie es auch für die Arbeit mit der aktuellen Version nutzen können.\nEine Leseprobe zum neuen Buch finden Sie auf der <a href=\"https://angular-buch.com\">Startseite</a>.</p>\n<hr>\n\n<p>Die offizielle Roadmap für die Entwicklung von Angular in den nächsten Jahren ist übrigens in der Dokumentation zu finden: <a href=\"https://angular.io/guide/roadmap\">https://angular.io/guide/roadmap</a>.</p>\n<p>Wir wünschen Ihnen viel Spaß mit Angular 11!\nHaben Sie Fragen zur neuen Version, zum Update oder zu Angular? Schreiben Sie uns!</p>\n<p><strong>Viel Spaß wünschen\nJohannes, Danny und Ferdinand</strong></p>\n<p><small><strong>Titelbild:</strong> Nationalpark Harz, Oktober 2020. Foto von Ferdinand Malcher</small></p>\n","meta":{"title":"Angular 11 ist da!","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2020-11-14T00:00:00.000Z","lastModified":"2020-11-14T00:00:00.000Z","keywords":["Angular","Angular 11","TypeScript","TSLint","ESLint","Hot Module Reloading"],"language":"de","thumbnail":"https://website-articles.angular-buch.com/2020-11-angular11/angular11.jpg","sticky":false}}
