{"slug":"2023-02-neu-vierte-auflage","html":"<p><strong>Das neue deutschsprachige Angular-Buch ist da!</strong>\nAb sofort ist die 4. Auflage des erfolgreichen Standardwerks im Handel verfügbar.</p>\n<p>Auf <strong>930 Seiten</strong> präsentieren wir Ihnen einen praktischen Einstieg in das Webframework Angular.\nFür die vierte Auflage haben wir das Buch vollständig überarbeitet:\nWir haben das Beispielprojekt, alle Texte und den Aufbau des Buchs kritisch hinterfragt und zum großen Teil neu erarbeitet.\nEs war unser Ziel, ein zeitloses und umfangreiches Nachschlagewerk für den Entwicklungsalltag zu schaffen.</p>\n<p>Alle Inhalte sind auf dem aktuellen Stand von Angular 15.\nNeue Features wie Standalone Components, typisierte Reactive Forms, funktionale Guards und Interceptors und die Funktion <code>inject()</code> haben wir von Anfang an berücksichtigt.\nDamit ist das Buch auch für die kommenden Versionen des Angular-Frameworks geeignet.</p>\n<p>Im <a href=\"/blog/2022-12-changelog-vierte-auflage\">Changelog zur vierten Auflage</a> erhalten Sie einen Überblick über die Änderungen und Erweiterungen.\nDurch die grundlegende Überarbeitung lohnt sich der Umstieg auf das neue Buch auch für Leserinnen und Leser der älteren Auflagen.</p>\n<p>Das Buch ist zum Preis von 42,90 € in jeder Buchhandlung und im Online-Handel erhältlich.\nEine Übersicht haben wir unter <strong><a href=\"/kaufen\">&quot;Jetzt kaufen&quot;</a></strong> zusammengestellt.</p>\n<blockquote>\n<p><strong>Das Buch ist auch als E-Book erhältlich. Sie können es in den Formaten PDF, ePub und Mobi sowie im Bundle (Print + E-Book) <a href=\"https://dpunkt.de/produkt/angular-6/\">direkt beim dpunkt.verlag</a> erwerben.</strong></p>\n</blockquote>\n<div class=\"row\">\n  <div class=\"col-6\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-02-neu-vierte-auflage/buch700/IMG_5997.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-6\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-02-neu-vierte-auflage/buch700/IMG_6009.jpg\" alt=\"\">\n  </div>\n</div>\n\n<h2 id=\"das-große-praxisbuch-zu-angular\">Das große Praxisbuch zu Angular!</h2>\n<p>Mit einem anspruchsvollen Beispielprojekt führen die Autoren Sie durch die Welt von Angular.\nEntwickeln Sie Schritt für Schritt eine umfangreiche modulare Single-Page-Anwendung und üben Sie Angular im praktischen Einsatz.\nMit seinen umfangreichen Theorieteilen ist dieses Buch außerdem Ihr praktischer Begleiter im Entwicklungsalltag.\nDie Autoren sind erfahrene Workshopleiter, Entwickler und internationale Konferenzsprecher.\nIn dieser vollständig überarbeiteten Auflage vermitteln sie die Best Practices aus ihrer täglichen Arbeit mit Angular.\nAufgrund ihres Engagements rund um das Buch und Angular wurden Ferdinand und Johannes als Google Developer Experts (GDE) ausgezeichnet.</p>\n<h3 id=\"aus-dem-inhalt\">Aus dem Inhalt:</h3>\n<ul>\n<li>Reaktive Programmierung mit RxJS</li>\n<li>State Management mit Redux und NgRx</li>\n<li>Testing mit Jasmine, Karma, Jest und Cypress</li>\n<li>Module und Standalone Components</li>\n<li>Routing und Guards</li>\n<li>HTTP und Interceptors</li>\n<li>Formularverarbeitung</li>\n<li>Dependency Injection und Services</li>\n<li>Barrierefreiheit (a11y)</li>\n<li>Internationalisierung (i18n)</li>\n<li>Progressive Web Apps (PWA)</li>\n</ul>\n<p>Erste Kenntnisse in JavaScript und HTML sind von Vorteil, aber keine Voraussetzung.\nWer nicht mit TypeScript vertraut ist, findet im Buch eine fundierte Einführung.\nAuf der Website zum Buch werden außerdem regelmäßig Aktualisierungen und Neuigkeiten rund um Angular veröffentlicht.</p>\n<h3 id=\"neu-in-dieser-auflage\">Neu in dieser Auflage:</h3>\n<ul>\n<li>durchgängig aktualisiert auf Angular 15 und neuere Versionen</li>\n<li>alle Inhalte vollständig überarbeitet und neu strukturiert</li>\n<li>mit den neuesten Themen aus der Angular-Welt:<ul>\n<li>Standalone Components</li>\n<li>Reactive Forms mit Typisierung</li>\n<li>funktionale Guards und Resolver</li>\n<li>Dependency Injection mit der neuen Funnktion <code>inject()</code></li>\n</ul>\n</li>\n</ul>\n<div class=\"row\">\n  <div class=\"col-4\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-02-neu-vierte-auflage/buch700/IMG_5984.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-02-neu-vierte-auflage/buch700/IMG_5991.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-02-neu-vierte-auflage/buch700/IMG_5989.jpg\" alt=\"\">\n  </div>\n</div>\n\n<h2 id=\"hintergrund\">Hintergrund</h2>\n<p>Die Welt der Webentwicklung bewegt sich schnell, und ein Framework wie Angular muss mit dem Puls der Zeit wachsen.\nSeit dem Release der ersten Ausgabe unseres Buchs hat sich viel verändert.\nIn den letzten Ausgaben haben wir daher versucht, auf neue Features und neu etablierte Techniken zu reagieren und das Buch aktuell zu halten.\nIn unserem <a href=\"/blog\">Blog</a> haben wir außerdem kurzfristig über neue Features und Änderungen informiert.</p>\n<p>Die 3. Auflage dieses Buchs erschien im Oktober 2020. Mit den neuesten Entwicklungen rund um Angular ist aber auch dieses etablierte Buch inzwischen in die Jahre gekommen.</p>\n<p>Wir haben uns deshalb seit September 2021 mehr als ein Jahr Zeit genommen, um das Buch vollständig neu zu erarbeiten.\nGanz bewusst wollten wir das Buch nicht nur aktualisieren, sondern auch Baustellen bearbeiten, für die wir in den letzten Auflagen keine Zeit gefunden hatten.</p>\n<p>Wir haben das Beispielprojekt von Grund auf neu entwickelt, haben die Inhalte und die Reihenfolge der Kapitel kritisch hinterfragt, haben ganze Kapitel neu verfasst und haben auch Texte entfernt, die nach unserer Einschätzung nicht mehr relevant waren.\nDurch den stetigen Austausch bei unseren <a href=\"https://angular.schule\">Angular-Schulungen</a>, in Kundenprojekten und mit der Community konnten wir die Schwerpunkte neu setzen und den didaktischen Aufbau des Buchs verfeinern.</p>\n<p>Das Buch ist auf dem aktuellen Stand von Angular 15.\nWir konnten damit auch den neuen Ansatz der <strong>Standalone Components</strong> fundiert abdecken.\nDa Angular-Module weiterhin relevant für die Entwicklung sind, haben wir beide Welten kombiniert.\nAuch kleinere Neuerungen wie die Funktion <code>inject()</code> oder funktionale Guards und Interceptors werden ausführlich behandelt.</p>\n<p>Weiterhin werden wir in unseren Blogartikeln über neue Features in Angular informieren.\nDen Code zum Beispielprojekt aus dem Buch werden wir regelmäßig aktualisieren.\nSollten Breaking Changes auftreten, finden Sie die wichtigsten Infos dazu immer in unserem Blog.</p>\n<p>Wir freuen uns, dass das neue Buch nach intensiver Arbeit nun im Handel erhältlich ist – und wir hoffen, dass es Ihr treuer Begleiter bei der täglichen Arbeit mit Angular wird!</p>\n<p>Sollten Sie Feedback, Anmerkungen oder Fragen haben, zögern Sie nicht, uns zu schreiben!\nWir sind per Mail unter <a href=\"mailto:team@angular-buch.com\">team@angular-buch.com</a> oder <a href=\"https://twitter.com/angular_buch\">Twitter</a> für Sie da.</p>\n<p>Mit besten Grüßen –\ndas Autorenteam<br>\n<strong>Ferdinand Malcher, Danny Koppenhagen und Johannes Hoppe</strong></p>\n<div class=\"row mb-5\">\n  <div class=\"col\">\n    <img src=\"%%MARKDOWN_BASE_URL%%/blog/2023-02-neu-vierte-auflage/buch700/IMG_6007.jpg\" alt=\"\">\n  </div>\n</div>\n\n\n\n<p><a class=\"btn btn-outline-primary cta__button index__cta mr-2 mb-2\" role=\"button\" target=\"_blank\" href=\"https://angular-buch.com/assets/angular-buch-leseprobe-auflage4.pdf\">Kostenlose Leseprobe <img src=\"assets/img/symbol-cloud.svg\"></a>\n<a class=\"btn btn-primary cta__button mb-2\" role=\"button\" target=\"_blank\" href=\"/kaufen\">4. Ausgabe jetzt bestellen</a></p>\n","meta":{"title":"4. Auflage: Das neue Angular-Buch ist da!","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2023-02-13T00:00:00.000Z","lastModified":"2023-02-12T00:00:00.000Z","keywords":["Angular","Buch","Release","Buchhandel","Vierte Auflage","Standalone Components","inject()","Functional Guards","Angular 15"],"language":"de","header":{"url":"header4a.png","width":2000,"height":832},"sticky":false,"hidden":false,"darkenHeader":false}}
