{"slug":"2019-06-changelog-zweite-auflage","html":"<p>Im Juni 2019 erschien die zweite Auflage des deutschsprachigen Angular-Buchs.</p>\n<p>In den zwei Jahren seit Veröffentlichung der ersten Auflage haben sich viele Dinge geändert:\nEs wurden Best Practices etabliert, neue Features eingeführt, und einige wenige Features wurden wieder entfernt.\nDie Webplattform bewegt sich schnell, und so muss auch ein Framework wie Angular stets an neue Gegebenheiten angepasst werden und mit den Anforderungen wachsen.</p>\n<p>Die zweite Auflage wurde deshalb grundlegend aktualisiert und erweitert.\nWir möchten Ihnen einen kurzen Überblick über die Neuerungen und Aktualisierungen der zweiten Auflage geben.\nAlle Texte und Codebeispiele haben wir auf die aktuelle Angular-Version 8 aktualisiert.</p>\n<h2 id=\"neue-kapitel\">Neue Kapitel</h2>\n<p>Folgende Kapitel und Abschnitte sind in dieser Auflage neu hinzugekommen:</p>\n<ul>\n<li>Interceptoren: HTTP-Requests abfangen und transformieren (Kapitel 10.3)</li>\n<li>Server-Side Rendering mit Angular Universal (Kapitel 19)</li>\n<li>Wissenswertes (Kapitel 24)<ul>\n<li>Container und Presentational Components (Kapitel 24.1)</li>\n<li>TrackBy-Funktion für die Direktive ngFor (Kapitel 24.3)</li>\n<li>Schematics: Codegenerierung mit der Angular CLI (Kapitel 24.4)</li>\n<li>Angular Material und weitere UI-Komponentensammlungen (Kapitel 24.6)</li>\n<li>Angular updaten (Kapitel 24.11)</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"vollständig-neu-geschriebene-kapitel\">Vollständig neu geschriebene Kapitel</h2>\n<p>Einige bereits in der ersten Auflage existierende Kapitel wurden für die zweite Auflage vollständig neu aufgerollt:</p>\n<h3 id=\"schnellstart-kapitel-1\">Schnellstart (Kapitel 1)</h3>\n<p>Der Schnellstart basierte in der ersten Auflage auf einer lokalen Lösung mit SystemJS und Paketen aus einem CDN. Der neue Schnellstart setzt auf die Online-Plattform <a href=\"https://stackblitz.com\">StackBlitz</a> zum schnellen Prototyping von Webanwendungen.</p>\n<h3 id=\"reaktive-programmierung-mit-rxjs-kapitel-102\">Reaktive Programmierung mit RxJS (Kapitel 10.2)</h3>\n<p>Das Prinzip der reaktiven Programmierung und das Framework RxJS haben in den letzten Jahren weiter an Bedeutung gewonnen. Das alte Kapitel zu RxJS lieferte nur einen kurzen Überblick, ohne auf Details einzugehen. Mit dieser Neufassung finden Sie jetzt eine ausführliche Einführung in die Prinzipien von reaktiver Programmierung und Observables, und es werden alle wichtigen Konzepte anhand von Beispielen erklärt. Im Gegensatz zur ersten Auflage verwenden alle Beispiele im Buch die aktuelle Syntax von RxJS mit den <em>Pipeable Operators</em>.</p>\n<h3 id=\"formularverarbeitung--validierung-iteration-iv-kapitel-12\">Formularverarbeitung &amp; Validierung: Iteration IV (Kapitel 12)</h3>\n<p>In der ersten Auflage haben wir sowohl <em>Template-Driven Forms</em> als auch <em>Reactive Forms</em> gleichbedeutend vorgestellt. Wir empfehlen mittlerweile nicht mehr den Einsatz von Template-Driven Forms. Daher stellen wir zwar beide Ansätze weiterhin vor, legen aber im Kapitel zur Formularverarbeitung einen stärkeren Fokus auf Reactive Forms. Das Praxisbeispiel wurde neu entworfen, um eine saubere Trennung der Zuständigkeiten der Komponenten zu ermöglichen. Die Erläuterungen im Grundlagenteil wurden neu formuliert, um besser für die Anforderungen aus der Praxis geeignet zu sein.</p>\n<h3 id=\"state-management-mit-redux-kapitel-20\">State Management mit Redux (Kapitel 20)</h3>\n<p>In den letzten zwei Jahren hat sich unserer Ansicht nach das Framework <em>NgRx</em> gegen weitere Frameworks wie <em>angular-redux</em> klar durchgesetzt. Während die erste Auflage in diesem Kapitel noch auf angular-redux setzte, arbeitet das neue Kapitel durchgehend mit den <em>Reactive Extensions for Angular (NgRx)</em>. Das neue Kapitel erarbeitet in der Einführung schrittweise ein Modell für zentrales State Management, um die Architektur von Redux zu erläutern, ohne eine konkrete Bibliothek zu nutzen.</p>\n<h2 id=\"stark-überarbeitete-und-erweiterte-kapitel\">Stark überarbeitete und erweiterte Kapitel</h2>\n<h3 id=\"einführung-in-typescript-kapitel-4\">Einführung in TypeScript (Kapitel 4)</h3>\n<p>Das Grundlagenkapitel zu TypeScript wurde neu strukturiert und behandelt zusätzlich auch neuere Features von ECMAScript/TypeScript, z. B. Destrukturierung, Spread-Operator und Rest-Syntax.</p>\n<h3 id=\"http-kommunikation-ein-server-backendanbinden-kapitel-101\">HTTP-Kommunikation: ein Server-Backendanbinden (Kapitel 10.1)</h3>\n<p>Das HTTP-Kapitel setzt durchgehend auf den <code>HttpClient</code>, der mit Angular 4.3 eingeführt wurde.\nDabei wird der Blick auch auf die erweiterten Features des Clients geworfen. Themen, die spezifisch für RxJS sind, wurden aus diesem Kapitel herausgelöst und werden nun im RxJS-Kapitel behandelt.</p>\n<h3 id=\"resolver-asynchrone-daten-beim-routing-vorladen-kapitel-1441\">Resolver: asynchrone Daten beim Routing vorladen (Kapitel 14.4.1)</h3>\n<p>Resolver sind aus unserer Sicht nicht die beste Wahl, um reguläre Daten über HTTP nachzuladen. Der Iterationsschritt zu Resolvern wurde deshalb aus dem Beispielprojekt entfernt, und das Thema wird in dieser Auflage nur noch in der Theorie behandelt.</p>\n<h3 id=\"i18n-mehrere-sprachen-und-kulturen-anbieten-kapitel-151\">i18n: mehrere Sprachen und Kulturen anbieten (Kapitel 15.1)</h3>\n<p>Die Möglichkeiten zur Konfiguration des Builds wurden mit Angular 6 stark vorangebracht.\nViele zuvor notwendige Kommandozeilenparameter sind nun nicht mehr notwendig, die Konfigurationsdatei <code>angular.json</code> löst diese ab. Dadurch konnten wir das Kapitel zur Internationalisierung (i18n) kürzen und verständlicher gestalten. Im Gegensatz zur ersten Auflage zeigen wir nicht mehr, wie man eine Anwendung im JIT-Modus internationalisiert, der hauptsächlich für die Entwicklung vorgesehen ist, aber nicht für produktive Anwendungen.</p>\n<h3 id=\"softwaretests-kapitel-171\">Softwaretests (Kapitel 17.1)</h3>\n<p>Das Kapitel zum Testen von Angular-Anwendungen wurde stark erweitert. Neben den reinen Werkzeugen wird der Fokus besonders auf Philosophien, Patterns und Herangehensweisen gelegt. Zusätzlich werden die mitgelieferten Tools zum Testen von HTTP und Routing betrachtet.</p>\n<h3 id=\"nativescript-mobile-anwendungen-entwickeln-kapitel-22\">NativeScript: mobile Anwendungen entwickeln (Kapitel 22)</h3>\n<p>Zur Entwicklung einer nativen mobilen Anwendung nutzen wir in diesem Kapitel die neue Version 7 von NativeScript, die insbesondere Verbesserungen in Sachen Codegenerierung und Wiederverwendbarkeit von Code mitbringt.</p>\n<h3 id=\"change-detection-kapitel-249\">Change Detection (Kapitel 24.9)</h3>\n<p>Das Kapitel zur Change Detection wurde für besseres Verständnis neu strukturiert. Insbesondere wird auf Debugging und Strategien zur Optimierung eingegangen.</p>\n<h2 id=\"sonstiges\">Sonstiges</h2>\n<p>Für die einzelnen Iterationsschritte aus dem Beispielprojekt bieten wir eine Differenzansicht an. So können die Änderungen am Code zwischen den einzelnen Kapiteln besser nachvollzogen werden. </p>\n<p><strong><a href=\"https://book-monkey3.angular-buch.com/diffs/\">https://book-monkey3.angular-buch.com/diffs/</a></strong></p>\n<p>Zu guter Letzt haben wir an ausgewählten Stellen in diesem Buch Zitate von bekannten Persönlichkeiten aus der Angular-Community aufgeführt.\nDie meisten dieser Zitate haben wir direkt für dieses Buch erbeten.\nWir freuen uns sehr, dass so viele interessante und humorvolle Worte diesem Buch eine einmalige Note geben.</p>\n","meta":{"title":"Changelog zur 2. Auflage","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2019-06-14T00:00:00.000Z","lastModified":"2019-06-14T00:00:00.000Z","keywords":["Angular","Buch","Changelog","Zweite Auflage"],"language":"de","header":{"url":"buchblogheader2.png","width":2000,"height":697},"sticky":false,"hidden":false,"darkenHeader":false}}
