{"slug":"2020-06-angular10","html":"<p>Nach nur vier Monaten Entwicklungszeit wurde am 24. Juni 2020 die neue Major-Version <strong>Angular 10.0</strong> veröffentlicht!\nDa sich das vorherige <a href=\"/blog/2020-02-angular9\">Major-Release von Angular 9</a> um einige Monate verzögert hatte, wurde Angular 10 bereits jetzt herausgegeben, um den üblichen Release-Zyklus von sechs Monaten einzuhalten.</p>\n<p>Wir werden Ihnen in diesem Artikel die wichtigsten Neuerungen vorstellen.\nEs gibt auch wieder kleinere Breaking Changes, doch das Update auf die neue Version geht dank der Angular CLI und den Schematics leicht von der Hand.\nDie offizielle Ankündigung zum neuen Release mit allen Features finden Sie im <a href=\"https://blog.angular.io/version-10-of-angular-now-available-78960babd41\">Angular-Blog</a>.</p>\n<h2 id=\"update-auf-angular-10\">Update auf Angular 10</h2>\n<p>Das Update zur neuen Angular-Version ist schnell erledigt.\nFühren Sie dazu die folgenden Befehle in Ihrem Projekt mit Angular 9 aus:</p>\n<pre><code class=\"language-bash\"><span class=\"hljs-attribute\">ng</span> update <span class=\"hljs-variable\">@angular</span>/cli <span class=\"hljs-variable\">@angular</span>/core\n</code></pre><p>Die Angular CLI führt automatisch alle nötigen Anpassungen am Code der Anwendung durch, sofern notwendig.</p>\n<p>Im <em>Angular Update Guide</em> unter <a href=\"https://update.angular.io/#9.0:10.0\">update.angular.io</a> können Sie übrigens wie üblich alle Migrationsschritte im Detail nachvollziehen und die Migration vorbereiten.</p>\n<h2 id=\"update-der-typescript-umgebung\">Update der TypeScript-Umgebung</h2>\n<h3 id=\"typescript-39-und-tslib-200\">TypeScript 3.9 und tslib 2.0.0</h3>\n<p>Mit Angular 10 unterstützt Angular nun <a href=\"https://www.typescriptlang.org/docs/handbook/release-notes/typescript-3-9.html\">TypeScript in der Version 3.9</a>.\nWeiterhin wurde die Abhängigkeit zur Bibliothek <em>tslib</em> auf die Version <em>2.0.0</em> angehoben.\nSofern Sie ein existierendes Angular-Projekt mit abhängigen Paketen haben, die eine <code>peerDependency</code> auf tslib 1.x.x besitzen, werden Sie bei der Ausführung von <code>ng update</code> wahrscheinlich folgende Fehlermeldung erhalten:</p>\n<pre><code>Package &quot;my-package&quot; has an incompatible peer dependency <span class=\"hljs-keyword\">to</span> &quot;tslib&quot; (requires &quot;^1.10.0&quot;, would install &quot;2.0.0&quot;).\n✖ Migration failed: Incompatible peer dependencies <span class=\"hljs-built_in\">found</span>.\nPeer dependency warnings <span class=\"hljs-keyword\">when</span> installing dependencies means that those dependencies might <span class=\"hljs-keyword\">not</span> <span class=\"hljs-keyword\">work</span> correctly together.\nYou can use the <span class=\"hljs-string\">&#x27;--force&#x27;</span> <span class=\"hljs-keyword\">option</span> <span class=\"hljs-keyword\">to</span> ignore incompatible peer dependencies <span class=\"hljs-keyword\">and</span> <span class=\"hljs-keyword\">instead</span> address these warnings later.\n</code></pre><p>Um dieses Problem zu beheben, können Sie in vielen Fällen die Fehlermeldung ignorieren und <code>ng update</code> mit dem Flag <code>--force</code> ausführen.\nHinterher sollten Sie jedoch zur Sicherheit noch einmal genau prüfen, ob Ihre Anwendung und Ihre Tests korrekt funktionieren.</p>\n<p>Ist Ihnen dieser Weg zu riskant, empfehlen wir Ihnen, noch etwas zu warten, bis die zu nutzende Bibliothek <code>tslib</code> in Version 2.0.0 unterstützt.\nPrüfen Sie ggf. im Repository der Bibliothek, ob bereits ein Issue zu diesem Thema eröffnet wurde, oder stellen Sie ein entsprechendes Issue für die Unterstützung von Angular 10 und tslib 2.0.0 ein. 👍</p>\n<h3 id=\"tslint-600\">TSLint 6.0.0</h3>\n<p>Ab Angular 10 wird TSLint in der Version 6.0.0 verwendet.\nSämtliche Änderungen an der Datei <code>tslint.json</code> werden bei der Ausführung von <code>ng update</code> automatisch durchgeführt.</p>\n<h2 id=\"browserslist\">Browserslist</h2>\n<p>Mit Angular 10 wurde die Standardkonfiguration für unterstütze Browser ein wenig aufgeräumt.\nDabei wurde auch der Dateiname von <code>browserslist</code> zu <code>.browserslistrc</code> geändert.</p>\n<p>Die Voreinstellungen in der Datei sind nun anders gesetzt: Standardmäßig werden jetzt die neueste oder die letzten beiden Versionen der wichtigsten Browser unterstützt.\nWenn Sie das Tool <code>browserslist</code> ausführen, erhalten Sie eine detaillierte Auflistung der unterstützten Browser, die in der aktuellen Konfiguration der Datei <code>.browserslistrc</code> inbegriffen sind:</p>\n<pre><code class=\"language-bash\">$ npx browserslist\nchrome <span class=\"hljs-number\">83</span>\nedge <span class=\"hljs-number\">83</span>\nedge <span class=\"hljs-number\">81</span>\nfirefox <span class=\"hljs-number\">77</span>\nfirefox <span class=\"hljs-number\">68</span>\nios_saf <span class=\"hljs-number\">13.4-13.5</span>\nios_saf <span class=\"hljs-number\">13</span>.<span class=\"hljs-number\">3</span>\nios_saf <span class=\"hljs-number\">13</span>.<span class=\"hljs-number\">2</span>\nios_saf <span class=\"hljs-number\">13.0-13.1</span>\nios_saf <span class=\"hljs-number\">12.2-12.4</span>\nios_saf <span class=\"hljs-number\">12.0-12.1</span>\nsafari <span class=\"hljs-number\">13</span>.<span class=\"hljs-number\">1</span>\nsafari <span class=\"hljs-number\">13</span>\nsafari <span class=\"hljs-number\">12</span>.<span class=\"hljs-number\">1</span>\nsafari <span class=\"hljs-number\">12</span>\n</code></pre><p>Sie können die <a href=\"https://github.com/browserslist/browserslist\">Werte hier selbstverständlich anpassen</a>.\nMöchten Sie beispielweise den Internet Explorer 11 unterstützen, fügen Sie den Eintrag <code>IE 11</code> zur Datei hinzu.\nAngular berücksichtigt die Einstellungen beim Build und erstellt beispielsweise Bundles mit ES5-Unterstützung, sofern sich ein Browser unter den Zielen befindet, der einen neueren JavaScript-Standard nicht unterstützt.</p>\n<h2 id=\"typescript-konfiguration-tsconfigbasejson\">TypeScript-Konfiguration <code>tsconfig.base.json</code></h2>\n<p>Die Projektstruktur mit den verschiedenen TypeScript-Konfigurationsdateien <code>tsconfig.*.json</code> wurde geändert.\nNeu ist hier die Datei <code>tsconfig.base.json</code>.</p>\n<p>Die Datei <code>tsconfig.json</code> bildet nun den <a href=\"https://devblogs.microsoft.com/typescript/announcing-typescript-3-9/#solution-style-tsconfig\">mit TypeScript 3.9 eingeführten <em>Solution Style</em></a> ab.\nDieses Format sorgt dafür, dass IDEs und Build Tools die Typ- und Package-Konfigurationen besser lokalisieren und auflösen können.\nIn der Datei <code>tsconfig.json</code> werden daher nur die genutzten TypeScript-Konfigurationen referenziert.\nZu Vermeidung von doppelten und gleichen Konfigurationseinstellungen in den einzelnen Config-Dateien existiert nun zusätzlich die Basiskonfiguration <code>tsconfig.base.json</code>.\nAlle anderen <code>tsconfig.*.json</code> laden die Einstellungen von dieser Basiskonfiguration mithilfe von <code>extends</code>.</p>\n<h2 id=\"warnung-bei-commonjs-imports\">Warnung bei CommonJS-Imports</h2>\n<p>Wenn in Ihrem Projekt eine Abhängigkeit zu einem Paket existiert, das auf das CommonJS-Format setzt, erscheint ab sofort eine Warnung beim Build der Anwendung.\nDie Warnung besagt, dass die Nutzung von CommonJS die <a href=\"https://web.dev/commonjs-larger-bundles/\">Bundle-Size der resultierenden Anwendung erheblich vergrößert</a>.\nUm die Warnung zu beheben, prüfen Sie am besten, ob Sie das abhängige Paket in einem anderen Format beziehen können, oder stellen Sie auch hier ein Issue im Repository des Projekts ein.</p>\n<h2 id=\"setup-mit-strikten-compiler-optionen\">Setup mit strikten Compiler-Optionen</h2>\n<p>Setzen Sie ein neues Projekt mit Angular auf, so können Sie bereits beim Setup eine striktere Typprüfung erwirken.\nHierfür nutzen Sie die Option <code>--strict</code>:</p>\n<pre><code class=\"language-bash\">ng <span class=\"hljs-keyword\">new</span> my-app <span class=\"hljs-comment\">--strict</span>\n</code></pre><p>Die Option bewirkt folgende Änderungen im Vergleich zum herkömmlichen Setup:</p>\n<ul>\n<li>Die <a href=\"https://dev.to/briwa/how-strict-is-typescript-s-strict-mode-311a\">Compiler-Option <code>strict</code> für TypeScript</a> wird gesetzt.</li>\n<li><a href=\"https://angular.io/guide/template-typecheck#strict-mode\">Striktere Template-Prüfungen</a> werden aktiv.</li>\n<li>Die Überprüfung der maximale Bundle-Größe über den Abschnitt <code>budgets</code> in der Datei <code>angular.json</code> wird um ca. 75% heruntergesetzt.</li>\n<li>TSLint wird so konfiguriert, dass jegliche Nutzung von <code>any</code> zu einem Fehler führt.</li>\n<li>Angular stellt in der <a href=\"https://webpack.js.org/guides/tree-shaking/#mark-the-file-as-side-effect-free\">Webpack-Konfiguration</a> ein, dass die Anwendung frei von Seiteneffekten ist. So kann beim Build der Anwendung ungenutzter Code sicher entfernt werden.</li>\n</ul>\n<p>Eine detaillierte Beschreibung aller Einstellungen bei Nutzung von <code>--strict</code> finden Sie in der offiziellen <a href=\"https://angular.io/guide/strict-mode\">Angular-Dokumentation</a>.</p>\n<h2 id=\"weitere-verbesserungen\">Weitere Verbesserungen</h2>\n<p>Natürlich gab es im Zuge der Entwicklung von Angular 10 auch wieder eine Vielzahl von kleineren Verbesserungen und Fehlerbehebungen.\nEine detaillierte Liste aller Änderungen können Sie dem offiziellen <a href=\"https://github.com/angular/angular/blob/main/CHANGELOG.md#1000-2020-06-24\">Changelog von Angular</a> und dem <a href=\"https://github.com/angular/angular-cli/releases/tag/v10.0.0\">Changelog der Angular CLI</a> entnehmen.</p>\n<h2 id=\"angular-buch-in-der-3-auflage\">Angular-Buch in der 3. Auflage</h2>\n<p>Die dritte Auflage des deutschsprachigen Angular-Buchs erschien im Oktober 2020 im Handel.\nWir haben das Buch vollständig <strong>auf Angular 10 aktualisiert</strong> und haben dabei auch neue Themen aufgenommen.</p>\n<hr>\n\n<p>Wir wünschen Ihnen viel Spaß mit Angular 10!\nHaben Sie Fragen zur neuen Version, zum Update oder zu Angular? Schreiben Sie uns!</p>\n<p><strong>Viel Spaß wünschen\nJohannes, Danny und Ferdinand</strong></p>\n<p><small><strong>Titelbild:</strong> Nationalpark Sächsische Schweiz, Juli 2017. Foto von Ferdinand Malcher</small></p>\n","meta":{"title":"Angular 10 ist da!","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2020-06-29T00:00:00.000Z","lastModified":"2020-06-29T00:00:00.000Z","keywords":["Angular","Angular 10","TypeScript","TSLint","Browserslist","tsconfig","CommonJS"],"language":"de","header":{"url":"angular10.jpg","width":2000,"height":612},"isUpdatePost":true,"hidden":false,"sticky":false,"darkenHeader":false}}
