{"slug":"2022-12-changelog-vierte-auflage","html":"<p><strong>Im Februar 2023 erschien die vierte Auflage des deutschsprachigen Angular-Buchs! In diesem Artikel berichten wir über die Neuerungen im neuen Buch.</strong></p>\n<p>Die Webplattform bewegt sich schnell, und so muss auch ein Framework wie Angular stets an neue Gegebenheiten angepasst werden und mit den Anforderungen wachsen.\nIn den sechs Jahren seit Veröffentlichung der ersten Auflage dieses Buchs haben sich viele Dinge geändert:\nEs wurden Best Practices etabliert, neue Features eingeführt, und einige wenige Features wurden wieder entfernt.</p>\n<p>Mit der neuen 4. Auflage haben wir die bislang größte und aufwendigste Überarbeitung gewagt:\nWir haben uns mehr als ein Jahr Zeit genommen, um das Konzept dieses Buchs zu überdenken und auch Ideen und Baustellen zu bearbeiten, auf die wir bei den früheren Auflagen nicht den Fokus gesetzt hatten.\nDabei haben wir mehr als 400 Tickets bearbeitet.</p>\n<p>Alle Texte und Beispiele haben wir grundlegend überarbeitet und zum großen Teil neu verfasst.\nDabei haben wir uns auch nicht davor gescheut, ganze Abschnitte zu löschen oder unsere Ideen aus der Vergangenheit kritisch zu hinterfragen.</p>\n<p>Es ist unser Ziel, einen umfassenden Einstieg in das Angular-Framework zu ermöglichen – und gleichzeitig ein <strong>modernes und zeitloses Nachschlagewerk</strong> zu schaffen.\nDie Arbeit mit dem Buch dieser vierten Auflage lohnt sich daher auch für Leserinnen und Leser, die bereits eine der früheren Ausgaben besitzen.\nDiesen &quot;frischen Wind der Veränderung&quot; haben wir auch auf dem Buchcover mit einem Motiv aus der Raumfahrt aufgegriffen.</p>\n<p>Wir möchten Ihnen einen kurzen Überblick über die wichtigsten Neuerungen und Aktualisierungen der vierten Auflage geben.\nAlle Inhalte haben wir auf die <strong>Angular-Version 15</strong> aktualisiert, sodass dieses Buch auch für die Arbeit mit den folgenden Versionen geeignet ist.</p>\n<p><a class=\"btn btn-outline-primary cta__button index__cta mr-2 mb-2\" role=\"button\" target=\"_blank\" href=\"https://angular-buch.com/assets/angular-buch-leseprobe-auflage4.pdf\">Kostenlose Leseprobe <img src=\"assets/img/symbol-cloud.svg\"></a>\n<a class=\"btn btn-primary cta__button mb-2\" role=\"button\" target=\"_blank\" href=\"/kaufen\">4. Ausgabe jetzt bestellen</a></p>\n<h2 id=\"neu-in-dieser-auflage\">Neu in dieser Auflage</h2>\n<p>Wir haben das Buch neu strukturiert und das Beispielprojekt von Grund auf neu entwickelt.\nDabei haben wir die Schwerpunkte anders gesetzt und die Erkenntnisse aus unserer täglichen Arbeit mit Angular berücksichtigt.\nDie Praxisteile sind nun leichtgewichtiger und behandeln ausschließlich die Umsetzung im Beispielprojekt.\nAlle notwendigen Grundlagen werden jeweils in den umfassenden Theorieteilen behandelt.\nBesonders wichtige Aspekte haben wir als Merksätze hervorgehoben.</p>\n<p>Um die Navigation im Buch zu vereinfachen, haben wir die frühere Gruppierung in &quot;Iterationen&quot; entfernt.\nDie Kapitel sind nun in einer <strong>flacheren Struktur</strong> organisiert.</p>\n<p>Alle Inhalte und Beispiele sind auf dem <strong>aktuellen Stand von Angular 15</strong>.\nDabei behandeln wir auch umfassend die neuesten Themen aus der Angular-Welt:</p>\n<ul>\n<li><strong>Standalone Components</strong> sind ein neuer Ansatz, um Komponenten, Pipes und Direktiven unabhängig von Angular-Modulen in der Anwendung zu verwenden. Wir betrachten dieses Konzept ausführlich in einem neuen Kapitel.</li>\n<li>Die Bausteine für die Formularverarbeitung mit <em>Reactive Forms</em> sind seit Angular 14 stark typisiert. Das Kapitel zu Reactive Forms behandelt diesen neueren Ansatz.</li>\n<li>Die neue <strong>Funktion <code>inject()</code></strong> ist eine Alternative zur klassischen Constructor Injection, um Abhängigkeiten anzufordern. Sie kann in Zukunft ein elementarer Bestandteil der Arbeit mit Angular werden. Wir nutzen die Funktion an geeigneten Stellen, um die Verwendung zu vertiefen.</li>\n<li><strong>Interceptors, Guards und Resolvers</strong> können als einfache Funktionen definiert werden. In früheren Versionen von Angular war dafür stets eine Klasse notwendig. Alle drei Bausteine werden nun ausführlich in der Theorie behandelt. Im Praxiskapitel zu den Guards implementieren wir auch einen funktionalen Guard, um einen Admin-Bereich abzusichern.</li>\n<li>Mit der <strong>Directive Composition API</strong> können Direktiven &quot;von innen&quot; auf ein Element angewendet werden. Auf dieses neue Konzept gehen wir im Kapitel zu Direktiven ausführlich ein.</li>\n<li>Viele weitere neue Features und Aspekte des Angular-Frameworks haben wir über das Buch hinweg berücksichtigt.</li>\n</ul>\n<p>In JavaScript wurde ein neuer Weg zur <strong>Initialisierung von Klassen-Propertys</strong> eingeführt, der sich vom proprietären Verhalten der Programmiersprache TypeScript unterscheidet. Unter &quot;Wissenswertes&quot; haben wir dieses Thema im Detail betrachtet. Der gesamte Code in diesem Buch ist so zukunftssicher ausgelegt, dass er in beiden Varianten problemlos funktioniert.</p>\n<p>Für das Beispielprojekt stellen wir erstmals ein <strong>eigenes Stylesheet-Paket</strong> bereit.\nZuvor hatten wir die Bibliothek <em>Semantic UI</em> genutzt, um die Anwendung zu gestalten.\nMit einem eigenen Stylesheet für unser Projekt verkürzen sich nun die HTML-Templates, und der Fokus liegt mehr auf der tatsächlichen Arbeit mit Angular.</p>\n<p>Das Thema der <strong>digitalen Barrierefreiheit</strong> ist ein wichtiger Bestandteil dieser Auflage.\nNeben einem neuen umfangreichen Kapitel zur Barrierefreiheit im Web haben wir auch das Beispielprojekt möglichst barrierearm umgesetzt.</p>\n<p><strong>Angular-Module</strong> sind ein wichtiger Baustein zur Strukturierung von Angular-Anwendungen. Anstatt das Thema erst zum Ende des Beispielprojekts zu behandeln, setzen wir nun schon frühzeitig im vierten Praxiskapitel darauf, die Anwendung in Module zu teilen.</p>\n<p>Die <strong>AsyncPipe</strong> ist ein elementarer Bestandteil von Angular, um die Arbeit mit Observables und Datenströmen zu vereinfachen.\nObwohl wir Pipes erst in einem späteren Kapitel ausführlich behandeln, haben wir die AsyncPipe bereits im Kapitel zu RxJS aufgegriffen.\nIm Beispielprojekt verwenden wir nun durchgehend die AsyncPipe, um Observables im Template aufzulösen. Damit orientieren wir uns an den etablierten Best Practices für Angular.</p>\n<p>Die <strong>Angular DevTools</strong> sind ein umfangreiches Debugging-Werkzeug für Angular-Anwendungen. In einem neuen Powertipp gehen wir auf die Möglichkeiten dieser Browser-Extension ein.</p>\n<p>Im Beispielprojekt setzen wir von vornherein auf das <strong>Analysetool ESLint</strong>, um einen einheitlichen Codestil zu ermöglichen und Best Practices technisch durchzusetzen.</p>\n<p>Die Kapitel zur <strong>Lokalisierung</strong> und <strong>Internationalisierung</strong> haben wir thematisch getrennt und aus dem Beispielprojekt herausgelöst.\nAm praktischen Beispiel erläutern wir dort nun auch die Möglichkeit, Übersetzungen zur Laufzeit der Anwendung zu laden.\nUnsere Anwendung ist jetzt zunächst in englischer Sprache geschrieben und wird anschließend deutsch lokalisiert. In den früheren Ausgaben war die Reihenfolge umgekehrt.</p>\n<p>Das Test-Framework Protractor wird nicht mehr weiterentwickelt. Im Kapitel zu Softwaretests setzen wir deshalb für die Oberflächentests nun auf das etablierte Framework <strong>Cypress</strong>. Außerdem erläutern wir die Möglichkeit, einzelne Komponenten mithilfe von Cypress zu testen (Cypress Component Test).</p>\n<p>In Kapitel zum Framework NgRx gehen wir auf den Architekturansatz der <strong>Facades</strong> ein.\nAußerdem betrachten wir das <strong>Framework <code>@ngrx/component-store</code></strong>, mit dem wir den lokalen Zustand von Komponenten verwalten können.</p>\n<p>Unter &quot;Wissenswertes&quot; geben wir einen kurzen Ausblick auf das populäre Build-Werkzeug <strong>Nrwl Nx</strong>, mit dem wir Monorepos effizient verwalten können.\nAußerdem werfen wir einen Blick auf das Tool <strong>Storybook</strong>, um die Komponenten der Anwendung in einem Katalog darzustellen.</p>\n<p>Wir haben umfangreiche Rückmeldungen von unseren Leserinnen und Lesern erhalten. Jede eingegangene Anmerkung haben wir ausführlich diskutiert und bestmöglich im Buch umgesetzt. Ein Fachbuch wie dieses lebt von dem <strong>Feedback aus der Community</strong>, und wir freuen uns, dass so viele Menschen ihre Anregungen zum Buch mitgeteilt haben.</p>\n<p>Wir haben uns in dieser Auflage zum ersten Mal für eine <strong>geschlechtsneutrale Ansprache</strong> entschieden. Wir freuen uns, dass wir so zumindest einen kleinen Teil dazu beitragen können, unsere alltägliche Sprache inklusiver zu gestalten.</p>\n<p>Zu guter Letzt haben wir über vielen Kapiteln <strong>Zitate</strong> von Persönlichkeiten aus der Angular-Community aufgeführt.\nDie meisten dieser Stimmen haben wir direkt für dieses Buch erbeten.\nWir freuen uns sehr, dass so viele persönliche, interessante und humorvolle Worte diesem Buch eine einmalige Note geben.</p>\n<p><img src=\"https://website-articles.angular-buch.com/2022-12-changelog-vierte-auflage/alle-cover.png\" alt=\"Buchcover der ersten bis vierten Auflage\"></p>\n<p><a class=\"btn btn-outline-primary cta__button index__cta mr-2 mb-2\" role=\"button\" target=\"_blank\" href=\"https://angular-buch.com/assets/angular-buch-leseprobe-auflage4.pdf\">Kostenlose Leseprobe <img src=\"assets/img/symbol-cloud.svg\"></a>\n<a class=\"btn btn-primary cta__button mb-2\" role=\"button\" target=\"_blank\" href=\"/kaufen\">4. Ausgabe jetzt bestellen</a></p>\n","meta":{"title":"Changelog zur 4. Auflage","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2022-12-21T00:00:00.000Z","lastModified":"2022-12-21T00:00:00.000Z","keywords":["Angular","Buch","Changelog","Vierte Auflage","4. Auflage","PWA","Docker","Redux","NgRx","RxJS","Barrierefreiheit (a11y)"],"language":"de","header":{"url":"changelog4a.png","width":2000,"height":717},"sticky":false}}
