{"slug":"2020-08-changelog-dritte-auflage","html":"<p>Im Oktober 2020 erschien die <strong>dritte Auflage</strong> des deutschsprachigen Angular-Buchs!</p>\n<p>Die Webplattform bewegt sich schnell, und so muss auch ein Framework wie Angular stets an neue Gegebenheiten angepasst werden und mit den Anforderungen wachsen.\nIn den drei Jahren seit Veröffentlichung der ersten Auflage dieses Buchs haben sich viele Dinge geändert:\nEs wurden Best Practices etabliert, neue Features eingeführt, und einige wenige Features wurden wieder entfernt.</p>\n<p>Die neue dritte Auflage haben wir deshalb grundlegend aktualisiert und erweitert.\nDabei haben wir das Feedback unserer Leser berücksichtigt, Fehler korrigiert und viele Erklärungen verständlicher formuliert.</p>\n<p>Wir möchten Ihnen einen kurzen Überblick über die wichtigsten Neuerungen und Aktualisierungen der dritten Auflage geben.\nAlle Texte und Codebeispiele haben wir auf die Angular-Version 10 aktualisiert.\nDabei betrachten wir auch neue Features.</p>\n<p><a class=\"btn btn-outline-primary cta__button index__cta mr-2 mb-2\" role=\"button\" target=\"_blank\" href=\"https://angular-buch.com/assets/angular-buch.com_leseprobe_3.auflage.pdf\">Kostenlose Leseprobe <img src=\"assets/img/symbol-cloud.svg\"></a>\n<a class=\"btn btn-primary cta__button mb-2\" role=\"button\" target=\"_blank\" href=\"https://amzn.to/30s4mVX\">3. Ausgabe jetzt bestellen</a></p>\n<h2 id=\"neue-kapitel\">Neue Kapitel</h2>\n<p>In der dritten Auflage sind die folgenden Kapitel neu hinzugekommen:</p>\n<h3 id=\"progressive-web-apps-pwa-kapitel-24\">Progressive Web Apps (PWA) (Kapitel 24)</h3>\n<p>Progressive Web Apps sind ein wichtiger Pfeiler für moderne Anwendungsentwicklung mit Webtechnologien. Hier spielen besonders Service Worker, Installierbarkeit, Offlinefähigkeit und Push-Benachrichtigungen eine Rolle. Da das Thema bisher in diesem Buch nicht behandelt wurde, haben wir ein neues Kapitel entwickelt. Sie lernen dabei die Grundlagen zu Progressive Web Apps und migrieren die Beispielanwendung zu einer PWA.</p>\n<h3 id=\"angular-anwendungen-mit-docker-bereitstellen-kapitel-19\">Angular-Anwendungen mit Docker bereitstellen (Kapitel 19)</h3>\n<p>Nachdem wir das Thema Docker in der zweiten Auflage nur in einem kurzen Abschnitt erwähnt hatten, haben wir nun ein ausführliches Kapitel neu ins Buch aufgenommen. Dort erläutern wir am praktischen Beispiel, wie Sie eine Angular-Anwendung in einem Docker-Container bereitstellen und ausführen können. Bei diesem Kapitel hat uns unser treuer Leser <strong>Michael Kaaden</strong> mit Praxiserfahrung und viel Zuarbeit unterstützt -- vielen Dank!</p>\n<h3 id=\"web-components-mit-angular-elements-kapitel-281\">Web Components mit Angular Elements (Kapitel 28.1)</h3>\n<p>Unter &quot;Wissenswertes&quot; sammeln wir interessante Themen, die im Verlauf des Buchs keinen Platz gefunden haben. Hier haben wir einen neuen Abschnitt zu Angular Elements hinzugefügt. Sie lernen, wie Sie Angular-Komponenten als Web Components verpacken, um sie auch in anderen Webanwendungen einzusetzen.</p>\n<h3 id=\"oauth2-und-openid-connect-abschnitt-1035\">OAuth2 und OpenID Connect (Abschnitt 10.3.5)</h3>\n<p>In der Iteration III erläutern wir die Kommunikation mit einem HTTP-Backend und betrachten Interceptoren, mit denen wir zum Beispiel Tokens in den Header einer HTTP-Nachricht einfügen können. In diesem Zusammenhang haben wir einen neuen Abschnitt hinzugefügt, in dem wir die Authentifizierung und Autorisierung mithilfe von OAuth 2 und OpenID Connect erläutern.</p>\n<h3 id=\"fortgeschrittene-konzepte-der-angular-cli-kapitel-27\">Fortgeschrittene Konzepte der Angular CLI (Kapitel 27)</h3>\n<p>Die Angular CLI kann mehr als nur eine Anwendung in einem Projekt verwalten. In diesem neuen Kapitel werfen wir deshalb einen Blick auf die Architektur eines <em>Workspace</em>, der mehrere Anwendungen und Bibliotheken in einem gemeinsamen Repository pflegt. Zusätzlich betrachten wir hier kurz die <em>Schematics</em>, die für die Codegenerierung in der Angular CLI verantwortlich sind.</p>\n<h2 id=\"stark-überarbeitete-und-erweiterte-kapitel\">Stark überarbeitete und erweiterte Kapitel</h2>\n<h3 id=\"reaktive-programmierung-mit-rxjs-kapitel-102\">Reaktive Programmierung mit RxJS (Kapitel 10.2)</h3>\n<p>Das Kapitel zu RxJS haben wir um einige wichtige Details ergänzt: So wurde die Erläuterung zu Higher-Order Observables überarbeitet und mit Marble-Diagrammen illustriert, wir haben den Unterschied zwischen Observer und Subscriber stärker herausgestellt und viele Erläuterungen vereinfacht.</p>\n<h3 id=\"i18n-mehrere-sprachen-und-kulturen-anbieten-kapitel-151\">i18n: mehrere Sprachen und Kulturen anbieten (Kapitel 15.1)</h3>\n<p>Das Thema Internationalisierung wurde mit Angular 9.0 neu aufgerollt und verfügt nun über erweiterte Funktionen, z. B. Übersetzungen im TypeScript-Code. Wir nutzen in diesem Kapitel jetzt das neue Paket <code>@angular/localize</code>, um Übersetzungen zu rendern.</p>\n<h3 id=\"build-und-deployment-mit-der-angular-cli-kapitel-18\">Build und Deployment mit der Angular CLI (Kapitel 18)</h3>\n<p>Das Kapitel zum Deployment haben wir neu strukturiert. Hier wird nun die Build-Konfiguration in der <code>angular.json</code> detailliert erläutert. Mit dem Release des neuen Ivy-Compilers ist auch das Thema JIT mehr in den Hintergrund gerückt. Außerdem haben wir einen neuen Abschnitt zum Befehl <code>ng deploy</code> hinzugefügt.</p>\n<h3 id=\"state-management-mit-redux-und-ngrx-kapitel-21\">State Management mit Redux und NgRx (Kapitel 21)</h3>\n<p>Das Framework NgRx wird stetig weiterentwickelt, und so haben wir das Kapitel zum State Management grundlegend aktualisiert. Wir setzen nun durchgehend auf die neuen Creator Functions und haben viele Erläuterungen ausführlicher und verständlicher gestaltet. Außerdem gehen wir auf das neue Paket <a href=\"https://ngrx.io/guide/component\">@ngrx/component</a> ein und werfen einen kurzen Blick auf das Community-Projekt <a href=\"https://github.com/BioPhoton/rx-angular\">RxAngular</a>.</p>\n<h3 id=\"server-side-rendering-mit-angular-universal-kapitel-20\">Server-Side Rendering mit Angular Universal (Kapitel 20)</h3>\n<p>Der Workflow für Server-Side Rendering wurde mit Angular 9.0 stark vereinfacht. Wir haben das Kapitel zu Angular Universal aktualisiert und erweitert: Dabei gehen wir auf den neuen Builder für statisches Pre-Rendering ein, geben Tipps für den Praxiseinsatz und betrachten das Community-Projekt <a href=\"https://scully.io/\">Scully</a>.</p>\n<h2 id=\"sonstiges\">Sonstiges</h2>\n<p>Neben den genannten Kapiteln haben wir alle Texte im Buch erneut kritisch überarbeitet.\nAn vielen Stellen haben wir Formulierungen angepasst, Details ergänzt und Fehler korrigiert.\nWenn Sie weitere Fehler finden oder Anregungen zum Buch haben, so <a href=\"mailto:team@angular-buch.com\">schreiben Sie uns bitte</a>! Wir werden uns Ihr Feedback in der nächsten Auflage zu Herzen nehmen.</p>\n<p>Für die einzelnen Iterationsschritte aus dem Beispielprojekt bieten wir eine Differenzansicht an. So können Sie die Änderungen am Code zwischen den einzelnen Kapiteln besser nachvollziehen:</p>\n<p><strong><a href=\"https://book-monkey4.angular-buch.com/diffs/\">https://book-monkey4.angular-buch.com/diffs/</a></strong></p>\n<p>Zu guter Letzt haben wir an ausgewählten Stellen in diesem Buch Zitate von Persönlichkeiten aus der Angular-Community aufgeführt.\nDie meisten dieser Zitate haben wir direkt für dieses Buch erbeten.\nWir freuen uns sehr, dass so viele interessante und humorvolle Worte diesem Buch eine einmalige Note geben.</p>\n<p><a class=\"btn btn-outline-primary cta__button index__cta mr-2 mb-2\" role=\"button\" target=\"_blank\" href=\"https://angular-buch.com/assets/angular-buch.com_leseprobe_3.auflage.pdf\">Kostenlose Leseprobe <img src=\"assets/img/symbol-cloud.svg\"></a>\n<a class=\"btn btn-primary cta__button mb-2\" role=\"button\" target=\"_blank\" href=\"https://amzn.to/30s4mVX\">3. Ausgabe jetzt bestellen</a></p>\n","meta":{"title":"Changelog zur 3. Auflage","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2020-08-07T00:00:00.000Z","lastModified":"2020-08-07T00:00:00.000Z","keywords":["Angular","Buch","Changelog","Dritte Auflage","PWA","Docker","Redux","NgRx","RxJS","Angular CLI","Monorepo"],"language":"de","header":{"url":"buchblogheader3-preorder.png","width":2000,"height":697},"sticky":false}}
