{"slug":"2021-06-angular12","html":"<p>Am 12.05.2021 wurde die neue Major-Version <strong>Angular 12.0</strong> veröffentlicht – ein halbes Jahr nach dem <a href=\"/blog/2020-11-angular11\">Release von Angular 11</a>.</p>\n<p>In diesem Artikel stellen wir wieder die wichtigsten Neuerungen vor.\nDie neue Version bringt einige wenige Breaking Changes mit sich, die aber wie üblich mit dem Befehl <code>ng update</code> automatisch migriert werden können.</p>\n<p>Die offizielle Ankündigung zum neuen Release mit allen Features finden Sie im <a href=\"https://blog.angular.io/angular-v12-is-now-available-32ed51fbfd49\">Angular-Blog</a>.</p>\n<p>Für alle Leser unseres Buchs haben wir einen <strong><a href=\"/blog/2022-06-bm4-update\">ausführlichen Blogartikel zum Update auf Angular 12 und neuer</a></strong> geschrieben, in dem wir alle nötigen Änderungen am Beispielprojekt BookMonkey auflisten. </p>\n<blockquote>\n<p><strong>Die allgemeinen Update-Infos für neuere Versionen von Angular finden Sie in separaten Blogartikeln. Wenn Sie das Update durchführen möchten, lesen Sie bitte alle Artikel in der gegebenen Reihenfolge.</strong></p>\n<ul>\n<li><a href=\"/blog/2021-11-angular13\">Angular 13 ist da!</a></li>\n<li><a href=\"/blog/2022-06-angular14\">Angular 14 ist da!</a></li>\n<li><a href=\"/blog/2022-11-angular15\">Angular 15 ist da!</a></li>\n</ul>\n</blockquote>\n<h2 id=\"update-auf-angular-12\">Update auf Angular 12</h2>\n<p>Um von einem Projekt mit Angular 11 auf die neue Major-Version 12 zu updaten, führen Sie in Ihrem Projekt den folgenden Befehl aus:</p>\n<pre><code class=\"language-bash\"><span class=\"hljs-attribute\">ng</span> update <span class=\"hljs-variable\">@angular</span>/cli <span class=\"hljs-variable\">@angular</span>/core\n</code></pre>\n<p>Im <em>Angular Update Guide</em> unter <a href=\"https://update.angular.io/#11.0:12.0\">update.angular.io</a> können Sie alle Migrationsschritte im Detail nachvollziehen und die Migration vorbereiten.</p>\n<h2 id=\"tslint-und-codelyzer\">TSLint und Codelyzer</h2>\n<p>Der Linter <em>TSLint</em>, auf den wir im Buch auf Seite 64 f. eingehen, ist seit 2019 deprecated. In neuen Projekten mit Angular 12 wird deshalb <strong>standardmäßig kein Linter mehr installiert</strong>.\nStattdessen muss ein Linting-Tool manuell im Projekt eingerichtet werden.</p>\n<p>Wir empfehlen den Linter <a href=\"https://eslint.org/\">ESLint</a> und das Projekt <a href=\"https://github.com/angular-eslint/angular-eslint\"><code>angular-eslint</code></a>, das bereits sinnvolle Lint-Regeln für Angular-Projekte mitbringt.\nZusätzlich benötigen Sie die <a href=\"https://marketplace.visualstudio.com/items?itemName=dbaeumer.vscode-eslint\">Extension für ESLint im VS Code</a>.\nSie können <code>angular-eslint</code> mit dem folgenden Befehl im Projekt einrichten:</p>\n<pre><code class=\"language-bash\">ng <span class=\"hljs-keyword\">add</span><span class=\"language-bash\"> @angular-eslint/schematics</span>\n</code></pre>\n<h2 id=\"e2e-testing-mit-protractor\">E2E-Testing mit Protractor</h2>\n<p>Zur Entwicklung von E2E-Tests wurde bisher in neuen Angular-Projekten stets das Tool <em>Protractor</em> mitgeliefert.\nSeit der Einführung von Protractor 2013 haben sich jedoch andere Tools wie Cypress, TestCafe oder Playwright stark in der Community etabliert.\nSeit Angular 12 setzen neue Angular-Projekte daher <strong>nicht</strong> mehr auf Protractor. Neue Anwendungen, die mit der Angular CLI v12 erzeugt werden, haben standardmäßig keinen <code>e2e</code>-Task mehr konfiguriert.\nDamit haben Entwickler:innen ab sofort die freie Wahl eines Tools für E2E-Tests.\nDer Support für Protractor wird voraussichtlich 2022 eingestellt. Wir empfehlen Ihnen daher, Protractor nach Möglichkeit nicht mehr zu verwenden.</p>\n<p>Um zum Beispiel <a href=\"https://www.cypress.io/\">Cypress</a> für E2E-Tests zu nutzen, können Sie die offiziellen Schematics zur Einrichtung verwenden:</p>\n<pre><code class=\"language-ts\">ng <span class=\"hljs-keyword\">add</span><span class=\"language-bash\"> @cypress/schematic</span>\n</code></pre>\n<h2 id=\"production-build-by-default\">Production-Build by default</h2>\n<p>In einem neuen Projekt mit Angular 12 wird für den Befehl <code>ng build</code> nun automatisch ein Production-Build ausgeführt.\nZuvor musste der Produktivmodus mit der Option <code>--prod</code> immer explizit aktiviert werden.\nIst ein Build mit den Development-Einstellungen gewünscht, muss diese Konfiguration beim Build direkt angegeben werden.\nDer Entwicklungswebserver mit <code>ng serve</code> verwendet weiterhin standardmäßig den Entwicklungsmodus</p>\n<pre><code class=\"language-bash\"><span class=\"hljs-comment\"># Production Build</span>\nng <span class=\"hljs-keyword\">build\n</span>\n<span class=\"hljs-comment\"># Development Build</span>\nng <span class=\"hljs-keyword\">build </span>--configuration=development\n\n<span class=\"hljs-comment\"># Development Build</span>\nng serve\n</code></pre>\n<p>Bestehende Angular-Projekte sind von den neuen Standardwerten zunächst nicht direkt betroffen. Es findet keine automatische Migration der Konfiguration (siehe <code>angular.json</code>) statt. \nBei Bedarf können die Konfigurationen nach dem regulären Update ebenfalls migriert werden:</p>\n<pre><code class=\"language-bash\">ng update <span class=\"hljs-meta\">@angular</span>/cli --migrate-only production-<span class=\"hljs-meta\">by</span>-<span class=\"hljs-keyword\">default</span>\n</code></pre>\n<h2 id=\"strict-mode-by-default\">Strict Mode by default</h2>\n<p>In neuen Angular-Projekten ist ab sofort standardmäßig der Strict Mode aktiviert. Bestehende Projekte sind von dieser Änderung ebenso nicht direkt betroffen.</p>\n<p>Zum Release von Angular 10 vor einem Jahr haben wir bereits einige Details zum Strict Mode <a href=\"/blog/2020-06-angular10#setup-mit-strikten-compiler-optionen\">im Blog veröffentlicht</a>.\nIn der <a href=\"https://angular.io/guide/strict-mode\">Angular-Dokumentation</a> finden Sie außerdem eine ausführliche Beschreibung.\nUnter Umständen erfordert der Strict Mode einige Anpassungen in Ihrem Code.\nWir empfehlen Ihnen, den Strict Mode zu aktivieren, um von der besseren Typisierung zu profitieren.</p>\n<p>Für den BookMonkey ergeben sich einige Änderungen, die wir in Kürze in einem separaten Blogartikel zusammenfassen werden.</p>\n<h2 id=\"angular-devtools\">Angular DevTools</h2>\n<p>Angular verfügt nun über eine offizielle Browser-Extension für Entwickler:innen: die <strong>Angular DevTools</strong>!\nDie neuen Entwicklungswerkzeuge helfen beim Debuggen und Profilen von Angular-Anwendungen und ersetzen die ältere Extension <a href=\"https://augury.rangle.io/\"><strong>Augury</strong></a>.\nDie DevTools sind in Zusammenarbeit mit dem langjährigen Partner rangle.io entstanden, aus dessen Feder auch Augury stammt.\nDie Angular DevTools sind für alle Anwendungen ab Angular 9 geeignet, die die Ivy-Engine nutzen.\nLesen Sie mehr hierzu in der offiziellen <a href=\"https://angular.io/guide/devtools\">Angular Dokumentation auf angular.io</a>.</p>\n<p><strong>Die Angular Dev Tools sind als <a href=\"https://chrome.google.com/webstore/detail/angular-devtools/ienfalfjdbdpebioblfackkekamfmbnh\">Google Chrome Extension</a> verfügbar.</strong></p>\n<p><img src=\"https://website-articles.angular-buch.com/2021-06-angular12/adt1.png\" alt=\"Angular DevTools – Komponentenansicht\">\n<img src=\"https://website-articles.angular-buch.com/2021-06-angular12/adt2.png\" alt=\"Angular DevTools – Profiler\"></p>\n<h2 id=\"inline-critical-css--fonts-css-inlining\">Inline Critical CSS / Fonts CSS Inlining</h2>\n<p>Im neuen Major-Release wurde weiter an Performance-Optimierungen gearbeitet.\nDabei wurde unter anderem das <a href=\"https://angular.io/guide/workspace-config#styles-optimization-options\">&quot;Critical CSS Inlining&quot;</a> eingeführt.\nDieses Feature sorgt dafür, dass die wichtigsten CSS-Styles direkt als Teil der <code>index.html</code> geladen werden.\nDamit wird die Zeit zum <a href=\"https://web.dev/first-contentful-paint\"><em>First Contentful Paint</em></a> reduziert und die wahrgenommene Performance der Anwendung verbessert.</p>\n<p>Eine weitere Optimierung gibt es für <a href=\"https://angular.io/guide/workspace-config#fonts-optimization-options\">blockierende Zugriffe auf Google Fonts</a>:\nWerden in der Anwendung Fonts aus dem Portfolio von Google Fonts verwendet, können diese zur Compile-Zeit automatisch heruntergeladen und direkt mit der Anwendung ausgeliefert werden.\nDas verhindert, dass externe Zugriffe auf Fonts das Laden der Seite blockieren.\nUm das Feature zu nutzen, muss eine Internetverbindung zu Google Fonts hergestellt werden.\nDies ist insbesondere beim Build in einer CI/CD-Pipeline zu beachten – ggf. müssen Sie hier entsprechende Proxy-Konfigurationen vornehmen.</p>\n<p>Beide Features sind bei neuen Angular-Projekten standardmäßig aktiv, können aber bei Bedarf durch Konfigurationen in der <code>angular.json</code> deaktiviert werden.</p>\n<h2 id=\"nullish-coalescing-in-der-template-syntax\">Nullish Coalescing in der Template Syntax</h2>\n<p>Mit Angular 12 wird die Template Syntax von Angular um einen Operator für <em>Nullish Coalescing</em> erweitert.\nDamit lassen sich Prüfungen auf <code>null</code> und <code>undefined</code> stark vereinfachen.\nDer Operator ist bereits aus TypeScript bekannt – darüber haben wir im <a href=\"https://angular-buch.com/blog/2020-02-angular9#nullish-coalescing-mit-typescript\">Blogpost zu Angular 9</a> berichtet.\nMit dem neuen Angular-Release ist die Syntax auch im Template verwendbar.</p>\n<p>Mit Nullish Coalescing lässt sich ein Fallback definieren, falls der gegebene Ausdruck <code>null</code> oder <code>undefined</code> ist.\nÜblicherweise müsste man eine solche Prüfung manuell formulieren.\nEin Beispiel: Der folgende Ausdruck soll eine Zahl ausgeben oder alternativ einen Fallback-Text liefern, falls keine Zahl gegeben ist:</p>\n<pre><code class=\"language-html\"><span class=\"hljs-template-variable\">{{ <span class=\"hljs-name\">yearsOfExperienceWithAngular</span> !== <span class=\"hljs-literal\">null</span> &amp;&amp; yearsOfExperienceWithAngular !== <span class=\"hljs-literal\">undefined</span> ? yearsOfExperienceWithAngular : <span class=\"hljs-string\">&#x27;Keine Angabe&#x27;</span> }}</span>\n</code></pre>\n<p>Mit Nullish Coalascing lässt sich der Ausdruck wie folgt vereinfachen:</p>\n<pre><code class=\"language-html\"><span class=\"hljs-template-variable\">{{ <span class=\"hljs-name\">yearsOfExperienceWithAngular</span> ?? <span class=\"hljs-string\">&#x27;Keine Angabe&#x27;</span> }}</span>\n</code></pre>\n<p>Im Gegensatz zur Prüfung mit <code>||</code> ist mit Nullish Coalescing auch eine <code>0</code> ein valider Wert.</p>\n<h2 id=\"ivy-engine-in-bibliotheken\">Ivy Engine in Bibliotheken</h2>\n<p>Die Ivy-Rendering Engine, die bereits seit Angular 9 standardmäßig verwendet wird, wird nun auch in Library-Projekten stärker forciert.\nDie veraltete <em>View Engine</em> wird mit kommenden Version 13 endgültig entfernt.\nAutor:innen von Bibliotheken sollten ihre Releases also innerhalb der nächsten Monate auf Ivy umstellen.</p>\n<p>Mehr Details zur Umstellung von Librarys und zu den Hintergründen finden Sie im <a href=\"https://blog.angular.io/upcoming-improvements-to-angular-library-distribution-76c02f782aa4\">Blogpost &quot;Upcoming improvements to Angular library distribution&quot; auf angular.io</a>.\nDiese Änderung ist für Sie vor allem interessant, wenn Sie Bibliotheken mit Angular-Bestandteilen auf NPM veröffentlichen.</p>\n<h2 id=\"deprecated-support-für-den-ie-11\">Deprecated: Support für den IE 11</h2>\n<p>Angular 12 wird die letzte Major-Version mit Support für den Internet Explorer 11 sein. Dadurch kann Angular von Altlasten bereinigt werden und in Zukunft auf modernere Web-APIs zurückzugreifen, die nur in aktuellen Browsern unterstützt werden.</p>\n<p>Microsoft hat seit geraumer Zeit den Internet Explorer abgekündigt und dessen Weiterentwicklung zugunsten des neuen Browsers <a href=\"https://www.microsoft.com/de-de/edge\">Edge</a> eingestellt. Ab dem 15. Juni 2022 wird der Internet Explorer dann von Microsoft endgültig <a href=\"https://github.com/angular/angular/issues/41840\">&quot;in Rente geschickt&quot;</a>. Wir begrüßen daher die Entscheidung des Angular-Teams sehr, die Unterstützung für den veralteten Internet Explorer ebenso einzustellen. Zuvor wurde die Entscheidung mit der Community über einen <a href=\"https://github.com/angular/angular/issues/41840\">RFC</a> diskutiert. </p>\n<h2 id=\"weitere-neuigkeiten\">Weitere Neuigkeiten</h2>\n<p>Wir haben bis hierhin nur die wichtigsten Neuerungen aufgeführt. Eine ausführliche Aufstellung aller Änderungen finden Sie im <a href=\"https://github.com/angular/angular/blob/master/CHANGELOG.md\">Changelog von Angular</a>.\nFolgende Punkte sind zusätzlich erwähnenswert:</p>\n<ul>\n<li><strong>Webpack 5:</strong> Unter der Haube verwendet Angular nun Webpack 5 als Build- und Bundling-Tool. Damit wird das neue Feature der <a href=\"https://www.angulararchitects.io/en/aktuelles/the-microfrontend-revolution-part-2-module-federation-with-angular/\">Module Federation</a> auch im Zusammenhang mit Angular unterstützt.</li>\n<li><strong>Validatoren <code>min</code>/<code>max</code>:</strong> Verwendet man auf einem Input die Attribute <code>min</code> und <code>max</code> werden dadurch nun automatisch passende Validatoren aktiv. Bisher mussten diese Validatoren manuell auf das FormControl angewendet werden. Siehe <a href=\"https://github.com/angular/angular/pull/39063\">PR #39063</a></li>\n<li><strong><code>emitEvent</code> für Formulare:</strong> Einige weitere Methoden auf FormControl, FormArray und FormGroup besitzen jetzt auch die Einstellung <code>emitEvent</code>. Damit kann konfiguriert werden, ob die Methode ein Event im Datenstrom <code>valueChanges</code> emittiert oder nicht. Neu ist diese Option zum Beispiel bei <code>FormArray.clear()</code>, <code>FormArray.removeAt()</code> oder <code>FormGroup.addControl()</code>. Siehe <a href=\"https://github.com/angular/angular/pull/31031\">PR #31031</a> </li>\n<li><strong>Inline SASS/SCSS:</strong> Es ist nun auch möglich, in den Inline-Styles eine Komponente SASS oder SCSS zu verwenden. Vorher konnte hier nur reines CSS notiert werden.</li>\n<li><strong>App-Initializer mit Observables:</strong> Mit dem <a href=\"https://angular.io/api/core/APP_INITIALIZER\"><code>APP_INITIALIZER</code></a> können Funktionen bereitgestellt werden, die beim Start der App ausgeführt werden. Bisher musste eine solche Funktion immer eine Promise zurückgeben. Nun ist es auch möglich, hier ein Observable zu returnen.</li>\n<li><strong>i18n Legacy Message IDs</strong>: Seit Angular 11 wird für die autogenerierten IDs bei i18n ein neues Format genutzt. Mit dem neuen Release werden Migrationsskripte und eine <a href=\"https://angular.io/guide/migration-legacy-message-id\">Anleitung zur Migration</a> bereitgestellt, um das neue Format in der Anwendung zu nutzen.</li>\n<li><strong>Neue Optionen für <code>RouterLinkActive</code></strong>: Mit der Direktive <code>routerLinkActive</code> kann ein aktiver RouterLink automatisch mit einer CSS-Klasse versehen werden. Um den Aktivitätsstatus differenzierter zu bestimmen, wurden neue Optionen hinzugefügt. Siehe <a href=\"https://github.com/angular/angular/pull/40303\">PR #40303</a></li>\n</ul>\n<hr>\n\n<p>Die Roadmap für die zukünftige Entwicklung von Angular wird regelmäßig in der Dokumentation veröffentlicht: <a href=\"https://angular.io/guide/roadmap\">https://angular.io/guide/roadmap</a>.</p>\n<p>Wir wünschen Ihnen viel Spaß mit Angular 12!\nHaben Sie Fragen zur neuen Version, zum Update oder zu Angular? Schreiben Sie uns!</p>\n<p><strong>Viel Spaß wünschen<br>Danny, Ferdinand und Johannes</strong></p>\n<p><small><strong>Titelbild:</strong> Antelope Island State Park, Utah, USA, April 2018. Foto von Ferdinand Malcher</small></p>\n","meta":{"title":"Angular 12 ist da!","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2021-06-07T00:00:00.000Z","lastModified":"2022-06-30T00:00:00.000Z","keywords":["Angular","Angular 12","Angular DevTools","TypeScript","Protractor","E2E","Strict Mode","ESLint"],"language":"de","header":{"url":"angular12.jpg","width":2000,"height":758},"sticky":false}}
