{"slug":"2020-11-twa","html":"<p>Progressive Web Apps sind in den letzten Jahren immer populärer geworden.\nSie erlauben es uns, Webanwendungen auf dem Home-Bildschirm des Smartphones zu installieren und wie eine nativ installierte App zu benutzen.\nMit einer PWA können wir Daten mithilfe eines Service Workers cachen, um die Anwendung auch offline zu verwenden.\nWeiterhin kann eine PWA im Hintergrund Push-Benachrichtigungen vom Server empfangen und anzeigen.</p>\n<blockquote>\n<p>Wenn Sie noch keine Erfahrung mit der Umsetzung einer Angular-App als PWA haben, schauen Sie sich unseren Blog-Post <a href=\"/blog/2020-11-twa/blog/2019-07-progressive-web-app\"><em>&quot;Mach aus deiner Angular-App eine PWA&quot;</em></a> an oder werfen Sie einen Blick in unser <a href=\"/blog/2020-11-twa/angular-buch.com\"><em>Angular-Buch</em></a>, wo wir dieses Thema detailliert erläutern.</p>\n</blockquote>\n<p>Nach der Entwicklung einer PWA bleibt jedoch eine Hürde bestehen: Nutzer der Anwendung müssen die URL kennen, über welche die PWA abrufbar ist und installiert werden kann.\nViele Smartphone-Nutzer sind jedoch einen anderen Weg gewohnt, um eine App zu installieren:\nSie suchen danach in einem App Store wie dem <em>Google Play Store</em> unter Android oder <em>App Store</em> unter iOS.</p>\n<p>In diesem Blogpost wollen wir Ihnen zeigen, wie Sie Ihre PWA auf einfachem Weg in den Google Play Store für Android bringen können, ohne eine echte Android-App mit Webview zu entwickeln, die lediglich eine Website aufruft.</p>\n<blockquote>\n<p><strong>Zur Zeit gibt es noch keine Möglichkeit, PWAs in Apples App Store zu deployen.</strong></p>\n</blockquote>\n<p>Inhalt:</p>\n<ul>\n<li><a href=\"/blog/2020-11-twa#trusted-web-activities-vs-webview-integration\">Trusted Web Activities vs. Webview-Integration</a></li>\n<li><a href=\"/blog/2020-11-twa#twas-im-detail\">TWAs im Detail</a></li>\n<li><a href=\"/blog/2020-11-twa#eine-pwa-als-twa-in-den-android-store-bringen\">Eine PWA als TWA in den Android Store bringen</a><ul>\n<li><a href=\"/blog/2020-11-twa#einen-android-developer-account-registrieren\">Einen Android Developer Account registrieren</a></li>\n<li><a href=\"/blog/2020-11-twa#die-android-app-in-der-google-play-console-erstellen\">Die Android-App in der Google Play Console erstellen</a></li>\n<li><a href=\"/blog/2020-11-twa#die-app-signatur-und-das-release-erzeugen\">Die App-Signatur und das Release erzeugen</a></li>\n<li><a href=\"/blog/2020-11-twa#den-app-signaturschl%C3%BCssel-in-der-pwa-hinterlegen\">Den App-Signaturschlüssel in der PWA hinterlegen</a></li>\n</ul>\n</li>\n<li><a href=\"/blog/2020-11-twa#die-twa-mit-der-bubblewrap-cli-erzeugen\">Die TWA mit der Bubblewrap CLI erzeugen</a></li>\n<li><a href=\"/blog/2020-11-twa#die-signierte-app-bauen\">Die signierte App bauen</a><ul>\n<li><a href=\"/blog/2020-11-twa#mit-der-bublewrap-cli\">Mit der Bublewrap CLI</a></li>\n<li><a href=\"/blog/2020-11-twa#mithilfe-von-android-studio\">Mithilfe von Android Studio</a></li>\n</ul>\n</li>\n<li><a href=\"/blog/2020-11-twa#die-app-%C3%BCber-die-google-play-console-ver%C3%B6ffentlichen\">Die App über die Google Play Console veröffentlichen</a></li>\n</ul>\n<h2 id=\"trusted-web-activities-vs-webview-integration\">Trusted Web Activities vs. Webview-Integration</h2>\n<p>Um PWAs als Android-App bereitzustellen, benötigen wir eine Art App-Wrapper, der schließlich die PWA aufruft und somit unsere Webanwendung darstellen kann.</p>\n<p>In der Vergangenheit wurde dies oft durch Android-Apps umgesetzt, die lediglich einen sogenannten <a href=\"https://developer.android.com/reference/android/webkit/WebView\"><em>WebView</em></a> integrieren.\nHinter diesem Feature versteckt sich ein integrierter Webbrowser in der Android-App, der lediglich den Inhalt der Website darstellt.\nDieser Weg funktioniert für eine Vielzahl von Websites, gerät jedoch an seine Grenzen, wenn es sich bei der Website um eine PWA handelt.\nDer Grund: In einem Webview funktionieren die essenziellen Service Worker nicht.\nSomit können wir Features wie die Offlinefähigkeit nicht einfach in die Anwendung integrieren.\nWeiterhin birgt ein Webview ein gewisses Sicherheitsrisiko, weil lediglich die URL den Inhalt der Anwendung bestimmt und keinerlei Überprüfung des tatsächlichen Contents stattfindet.\nWird also beispielsweise eine Website <em>&quot;gekapert&quot;</em>, bekommt der Nutzer ggf. den Inhalt einer falschen Seite angezeigt.</p>\n<p>Bei einer TWA hingegen wird die PWA lediglich so erweitert, dass sie als Android-App direkt deployt werden kann.\nÜber einen Sicherheitsschlüssel kann verifiziert werden, dass die aufgerufene URL zur App passt.</p>\n<h2 id=\"twas-im-detail\">TWAs im Detail</h2>\n<p>Die Grundidee einer TWA ist schnell erklärt: Statt einer vollumfänglichen Android-App, die einen Browser implementiert und eine URL aufruft, wird bei einer TWA leidglich die PWA um eine App-Schicht erweitert, sodass sie im Google Play Store veröffentlicht werden kann.\nEs muss also auch kein eingebetteter Browser in der App integriert werden, sondern es wird auf den vorhandenen Google Chrome Browser zurückgegriffen.\nVoraussetzung hierfür ist, dass auf dem Android-Gerät die Version 72 oder höher von Google Chrome verfügbar ist.\nBeim Öffnen der PWA wird Chrome mit der hinterlegten URL geöffnet, und es werden sämtliche UI-Elemente des Browsers ausgeblendet.\nIm Prinzip passiert also genau das, was auch geschieht, wenn wir eine PWA über die Funktion <em>&quot;Add To Homescreen&quot;</em> auf Smartphone speichern, jedoch in Form einer App, die über den Google Play Store gefunden und installiert werden kann.\nSomit bleiben Features wie Push-Benachrichtigungen, Hintergrundsynchronisierungen, Autofill bei Eingabeformularen, Media Source Extensions oder die Sharing API vollumfänglich erhalten.\nEin weiterer Vorteil einer solchen TWA ist, dass Session-Daten und der Cache im Google Chrome geteilt werden.\nHaben wir uns also beispielsweise bei unserer Web-Anwendung zuvor im Browser angemeldet, so belibt die Anmeldung in der Android-App (TWA) bestehen.</p>\n<p>Die Bezeichnung &quot;Trusted Web Activity&quot; lässt bereits darauf schließen: TWAs sind <em>trusted</em>, also vertraulich.\nDurch eine spezielle Datei, die mit der Webanwendung ausgeliefert wird und die einen Fingerprint enthält, kann sichergestellt werden, dass die Anwendung vertrauenswürdig ist, und der Inhalt kann somit sicher geladen werden.</p>\n<h2 id=\"eine-pwa-als-twa-in-den-android-store-bringen\">Eine PWA als TWA in den Android Store bringen</h2>\n<p>Genug der Theorie -- wir wollen nun erfahren, wie wir eine PWA im Android Store als TWA bereitstellen können.</p>\n<p>Dafür müssen wir folgende Schritte durchführen:</p>\n<ul>\n<li>Einen Android Developer Account registieren</li>\n<li>Die Android-App in der Google Play Console erstellen</li>\n<li>Die App-Signatur erzeugen</li>\n<li>Den App-Signaturschlüssel in der PWA hinterlegen</li>\n<li>Die TWA mit der <em>Bubblewrap CLI</em> erzeugen</li>\n<li>Die signierte App bauen</li>\n<li>Die App über die Google Play Console veröffentlichen</li>\n</ul>\n<p>Wir wollen als Grundlage für dieses Beispiel die Angular-Anwendung <em>BookMonkey</em> aus dem Angular-Buch verwenden, die bereits als PWA vorliegt.\nMöchten Sie die Schritte selbst nachvollziehen, können Sie die Anwendung über GitHub herunterladen:</p>\n<p><a href=\"https://github.com/book-monkey4/book-monkey4-pwa\">https://github.com/book-monkey4/book-monkey4-pwa</a></p>\n<pre><code>git <span class=\"hljs-keyword\">clone</span> <span class=\"hljs-title\">https</span>://ng-buch.de/bm4-pwa.git\n</code></pre><p>Die Online-Version der PWA können Sie unter der folgenden URL abrufen:</p>\n<p><a href=\"https://bm4-pwa.angular-buch.com/\">https://bm4-pwa.angular-buch.com/</a></p>\n<p>Weiterhin benötigen Sie für die Erstellung der TWA folgende Voraussetzungen auf dem Entwicklungssystem:</p>\n<ul>\n<li><a href=\"https://openjdk.java.net/install/\">Java SDK 8.0</a></li>\n<li><a href=\"https://developer.android.com/studio\">Android SDK (vorzugsweise Android Studio inkl. SDK)</a></li>\n<li><a href=\"https://nodejs.org\">Node.js 10.0 oder höher</a></li>\n</ul>\n<h3 id=\"einen-android-developer-account-registrieren\">Einen Android Developer Account registrieren</h3>\n<blockquote>\n<p>Sofern Sie bereits einen Account für die <em>Google Play Console</em> besitzen, können Sie diesen Schritt überspringen.</p>\n</blockquote>\n<p>Um eine App im Google Play Store einzustellen, benötigen wir zunächst einen Account für die <em>Google Play Console</em>.\nDen Account können Sie über den folgenden Link registrieren:</p>\n<p><a href=\"https://play.google.com/apps/publish/signup\">https://play.google.com/apps/publish/signup</a></p>\n<p>Bei der Registrierung wird eine einmalige Registrierungsgebühr in Höhe von 25 USD erhoben. Diese Gebühr gilt für sämtliche Apps, die Sie mit dem hinterlegten Google-Account registrieren wollen.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-register.png\" alt=\"Google Play Console: Registrierung\"></p>\n<h3 id=\"die-android-app-in-der-google-play-console-erstellen\">Die Android-App in der Google Play Console erstellen</h3>\n<p>Nach der Registierungs müssen wir uns in der <a href=\"https://play.google.com/apps/publish\"><em>Google Play Console</em> einloggen</a>.\nAnschließend können wir über den Menüpunkt <em>&quot;Alle Apps&quot;</em> mit dem Button <em>&quot;App erstellen&quot;</em> eine neue Anwendung anlegen.\nHier legen wir den Namen der Anwendung, die Standardsprache, den Anwendungstypen (App oder Spiel) sowie den Preis der Anwendung fest.\nWeiterhin müssen wir den Programmierrichtlinien für Entwickler sowie den Exportbestimmungen der USA zustimmen.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-create.png\" alt=\"Google Play Console: Eine neue Anwendung erzeugen\"></p>\n<p>Danach gelangen wir zum Dashboard für die neue Android-App.\nHier arbeiten wir uns im folgenden durch die Ersteinrichtung der App durch.\nJeder abgeschlossene Punkt wird entsprechend in der Liste markiert.\nAlle Einstellungen finden sich auch im Nachhinein links im Menü wieder und können auch noch später angepasst werden.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-after-create.png\" alt=\"Google Play Console: Dashboard - Ersteinrichtung\"></p>\n<ul>\n<li><strong>App-Zugriff</strong>: Hier hinterlegen Sie informationen, die darlegen, wie auf die App bei der Überprüfung vor der Freigabe im Google Play Store zugegriffen werden kann.\nBenötigen die Tester z. B. einen speziellen Account oder Standort oder ist die Anwendung frei zugänglich?</li>\n<li><strong>Anzeigen</strong>: An dieser Stelle geben Sie an, ob ihre App Werbung enthält oder nicht.</li>\n<li><strong>Einstufung des Inhalts</strong>: Sie werden zu einem Fragebogen zur Überprüfung der Altersfreigaben geleitet, den Sie ausfüllen müssen.\nAnschließend erhalten Sie eine Bewertung, die Ihnen die Alterseinstufung der Anwendung für verschiedene Länder angibt.</li>\n<li><strong>Zielgruppe</strong>: An dieser Stelle geben Sie an, welche Zielgruppe (Altersgruppe) von ihrer Anwendung adressiert wird und ob die Anwendung auch für Kinder interessant ist.\nJe nach Auswahl kann es sein, dass Sie zusätzlich eine Datenschutzerklärung hinterlegen müssen.</li>\n<li><strong>App-Kategorie auswählen und Kontaktdaten angeben</strong>: Hier gelangen Sie zu den <em>Play Store Einstellungen</em>.\nSie legen hier die Kategorie der App fest in der sie später im Play Store auftauchen soll.\nWeiterhin können Sie Tags vergeben und Sie müssen Kontaktdaten für den Store-Eintrag hinterlegen.</li>\n<li><strong>Store-Eintrag einrichten</strong>: Dieser Punkt führt Sie zur Hauptkonfiguration des Eintrags für den Google Play Store.\nSie müssen hier eine kurze sowie eine vollständige Beschreibung der Anwendung, eine App Icon und Screenshots der Anwendung hinterlegen.</li>\n</ul>\n<p>Haben wir alle Punkte für die Ersteinrichtung abgeschlossen, verschwindet der Abschnitt auf unserem Dashboard und wir können uns der Bereitstellung der App widmen.\nDafür benötigen wir ein Release und eine App-Signatur.</p>\n<h3 id=\"die-app-signatur-und-das-release-erzeugen\">Die App-Signatur und das Release erzeugen</h3>\n<p>Nach der Ersteinrichtung gilt es unsere App im Play Store bereitzustellen.\nBefinden wir uns auf dem Dashboard, so wird uns eine Übersicht über verschiedene Möglichkeiten zur Veröffentlichung der Anwendung gezeigt.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-dashboard-release.png\" alt=\"Google Play Console: Dashboard - App veröffentlichen\"></p>\n<p>Diese Wege repräsentieren die sogenannten <em>Tracks</em>.\nEin solcher Track kann verschiedene Ausprägungen haben:</p>\n<ul>\n<li><strong>Interner Test</strong>: Releases, die zum Test für einen bestimmten Personenkreis beispielsweise über einen Link bereitgestellt werden können</li>\n<li><strong>Geschlossener Test</strong>: Releases, die nur bestimmten Personen zum Download als Vorab-Release (Alpha Release) zur Verfügung stehen.</li>\n<li><strong>Offener Test</strong>: Releases, die für jeden Nutzer im Google Play Store bereitgestellt werden, aber als Vorab-Release (Beta Release) gekennzeichnet sind. Offene Tracks können auch auf eine bestimmte Anzahl von Nutzer begrenzt werden</li>\n<li><strong>Vorregistrierung</strong>: Releases, deren Store-Eintrag bereits vor Veröffentlichung der Anwendung erstellt werden soll. Nutzer können sich bereits registrieren und erhalten eine Benachrichtigung, sobald die Anwendung verfügbar ist.</li>\n<li><strong>Produktion</strong>: Releases, die für jeden Nutzer im Google Play Store bereitgestellt werden</li>\n</ul>\n<p>In unserem Szenario wollen wir unsere App direkt bis in den Google Play Store bringen, um zu verifizieren, dass diese auch tatsächlich von allen Nutzern gefunden und installiert werden kann.\nHierfür nutzen wir den Track für den offenen Test und erstellen ein Beta-Release.\nDafür klicken wir unter der Überschrift <em>&quot;Beliebigen Nutzern die Registrierung für das Testen deiner App bei Google Play erlauben&quot;</em> auf <em>&quot;Aufgaben einblenden&quot;</em>.\nHier klicken wir zunächst auf <em>&quot;Länder und Regionen auswählen&quot;</em>.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-dashboard-open-track.png\" alt=\"Google Play Console: Dashboard - Einen offenen Track anlegen\"></p>\n<p>Wir gelangen nun in das Untermenü zur Erstellung eines offenen Test Tracks und legen die Länder fest, in denen unsere Anwendung im Google Play Store verfügbar sein soll.\nAnschließend erstellen wir ein neues Release.</p>\n<p>Im nächsten Schritt benötigen wir nun die App, die wir unter <em>&quot;App Bundles und APKs&quot;</em> hinterlegen müssen.\nDamit diese App jedoch erzeugt und verifiziert werden kann, erzeugen wir zunächst unter dem Abschnitt <em>App-Signatur von Google Play</em> über den Button <em>&quot;Weiter&quot;</em> eine neue App Signatur.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-beta-sign.png\" alt=\"Google Play Console: Offenes Testrelease erstellen\"></p>\n<h3 id=\"den-app-signaturschlüssel-in-der-pwa-hinterlegen\">Den App-Signaturschlüssel in der PWA hinterlegen</h3>\n<p>Wir verlassen zunächst wieder den Menüpunkt zur Erzeugung des Releases und gehen ins Menü <em>&quot;Einrichten&quot;</em> &gt; <em>&quot;App-Signatur&quot;</em>.\nHier kopieren wir uns den Fingerabdruck des SHA-256-Zertifikats in die Zwischenablage.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-signature.png\" alt=\"Google Play Console: Kopieren des App-Signaturschlüssels\"></p>\n<p>Dieser Fingerabdruck stellt später sicher, dass beim Aufruf der PWA durch unsere TWA verifiziert werden kann, dass die Anwendung <em>trusted</em> ist, also von Google verifiziert.</p>\n<p>Um den Fingerabdruck aufspüren zu können, müssen wir diesen über die spezielle Datei <code>assetlinks.json</code> bereitstellen.\nWeiterhin muss die Datei und ihr Inhalt über die spezielle URL <code>https://my-app.com/.well-known/assetlinks.json</code> aufrufbar sein.</p>\n<p>Dafür erzeugen wir in unserem Angular-Workspace ein neues Verzeichnis <code>.well-known</code> unter <code>src</code>.\nDarin legen wir die Datei <code>assetlinks.json</code> mit dem folgenden Inhalt an:</p>\n<pre><code class=\"language-json\">[\n  {\n    <span class=\"hljs-string\">&quot;relation&quot;</span>: [<span class=\"hljs-string\">&quot;delegate_permission/common.handle_all_urls&quot;</span>],\n    <span class=\"hljs-string\">&quot;target&quot;</span>: {\n      <span class=\"hljs-string\">&quot;namespace&quot;</span>: <span class=\"hljs-string\">&quot;allfront&quot;</span>,\n      <span class=\"hljs-string\">&quot;package_name&quot;</span>: <span class=\"hljs-string\">&quot;com.angular_buch.book_monkey4&quot;</span>,\n      <span class=\"hljs-string\">&quot;sha256_cert_fingerprints&quot;</span>: [\n        <span class=\"hljs-string\">&quot;D1:63:25:CE...A4:FF:79:C0&quot;</span>\n      ]\n    }\n  }\n]\n</code></pre><p>Als <code>package_name</code> legen wir die Anwendungs-ID fest, die im Google Play Store eindeutig sein muss und genau auf eine App zeigt.\nDie ID wird in der Regel aus einer Domain gebildet und rückwärts gelistet.\nSie muss mindestens einen Punkt enthalten, Zeichen hinter einem Punkt dürfen nur Buchstaben sein, und die gesamte ID darf lediglich Alphanumerische Zeichen enthalten.\nZeichen wie &quot;<code>-</code>&quot; sind nicht erlaubt.\nAlle Regeln zur Definition einer validen ID können Sie der <a href=\"https://developer.android.com/studio/build/application-id\">Android Entwicklerdokumentstion</a> entnehmen.</p>\n<p>Unter <code>sha256_cert_fingerprints</code> müssen wir außerdem den kopierten App-Signaturschlüssel eintragen.</p>\n<p>Jetzt müssen wir der Angular CLI noch beibringen, dass der URL-Pfad <code>/.well-known/assetlinks.json</code> nicht durch den Angular-Router behandelt und umgeleitet werden soll, sondern dass sich dahinter ein statisches Asset verbrigt, das direkt über die URL aufrufbar sein soll.</p>\n<p>Dafür bearbeiten wir die Datei <code>angular.json</code>: Im Abschnitt <code>build</code> &gt; <code>options</code> ergänzen wir den Eintrag <code>assets</code>.\nDort geben wir an, dass alle Dateien unter <code>src/.well-known</code> über den relativen Pfad <code>/.well-known/</code> bereitgestellt werden sollen:</p>\n<pre><code class=\"language-json\">{\n  <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n  <span class=\"hljs-string\">&quot;projects&quot;</span>: {\n    <span class=\"hljs-string\">&quot;book-monkey&quot;</span>: {\n      <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n      <span class=\"hljs-string\">&quot;architect&quot;</span>: {\n        <span class=\"hljs-string\">&quot;build&quot;</span>: {\n          <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n          <span class=\"hljs-string\">&quot;options&quot;</span>: {\n            <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n            <span class=\"hljs-string\">&quot;assets&quot;</span>: [\n              <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n              {\n                <span class=\"hljs-string\">&quot;glob&quot;</span>: <span class=\"hljs-string\">&quot;**/*&quot;</span>,\n                <span class=\"hljs-string\">&quot;input&quot;</span>: <span class=\"hljs-string\">&quot;src/.well-known/&quot;</span>,\n                <span class=\"hljs-string\">&quot;output&quot;</span>: <span class=\"hljs-string\">&quot;/.well-known/&quot;</span>\n              }\n              <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n            ],\n            <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n          },\n          <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n        },\n        <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n      },\n      <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n    },\n    <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n  },\n  <span class=\"hljs-string\">//</span> <span class=\"hljs-string\">...</span>\n}\n</code></pre><p>Wir überprüfen das Ergebnis am Besten, indem wir einen Produktiiv-Build ausführen und einen einfachen Webserver starten:</p>\n<pre><code class=\"language-bash\">ng build --prod\n<span class=\"hljs-built_in\">cd</span> dist/book-monkey\nnpx http-server\n</code></pre><p>Rufen wir nun die URL <code>http://localhost:8080/.well-known/assetlinks.json</code> im Browser auf, sehen wir, dass unsere Datei <code>assetlinks.json</code> dargestellt wird:</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/assetlinks-browser.png\" alt=\"Test der Auslieferung der Datei `assetlinks.json` im Browser\"></p>\n<p>War der Test erfolgreich, können wir unsere PWA deployen.\nWichtig ist, dass diese zwingend per <code>HTTPS</code> ausgeleifert werden muss.</p>\n<blockquote>\n<p>Achtung: Nutzen Sie beispielsweise Github Pages zur Auslieferung Ihrer Anwendung, so müssen Sie vor dem Deployment im <code>dist</code>-Verzeichnis (<code>dist/book-monkey</code>) eine Datei <code>_config.yml</code> mit dem Inhalt <code>include: [&quot;.well-known&quot;]</code> anlegen, da alle Verzeichnisse beginnend mit &quot;<code>.</code>&quot; per Default <a href=\"https://github.com/keybase/keybase-issues/issues/366#issuecomment-38749201\">von Github Pages ignoriert werden</a>. Diesen Schritt integrieren Sie am besten in Ihre Deployment-Pipeline.</p>\n</blockquote>\n<p>Überprüfen Sie nach dem Deployment am Besten noch einmal, ob Sie die URL <code>http://mydomain/.well-known/assetlinks.json</code> aufrufen können.\nIn unserem Fall wäre das: <a href=\"https://bm4-pwa.angular-buch.com/.well-known/assetlinks.json\"><code>https://bm4-pwa.angular-buch.com/.well-known/assetlinks.json</code></a>.</p>\n<h2 id=\"die-twa-mit-der-bubblewrap-cli-erzeugen\">Die TWA mit der Bubblewrap CLI erzeugen</h2>\n<p>Wir haben nun unsere PWA so vorbereitet, dass sie als TWA genutzt werden kann. Alle nötigen Vorbereitungen in der Google Play Console haben wir getroffen.\nAls nächstes wollen wir die Android-App erstellen, die unsere PWA als TWA aufruft und als eigenständige App kapselt.</p>\n<p>Hierfür nutzen wir die <a href=\"https://www.npmjs.com/package/@bubblewrap/cli\"><em>Bubblewrap CLI</em></a>:\nWir können das Tool direkt als NPM-Paket über <code>npx</code> aufrufen und so die App erzeugen lassen.\nDer interaktive Wizard führt uns durch das Setup:</p>\n<pre><code class=\"language-bash\">mkdir monkey4-pwa-twa-<span class=\"hljs-keyword\">wrapper</span>\ncd monkey4-pwa-twa-<span class=\"hljs-keyword\">wrapper</span>\nnpx @bubblewrap/cli init <span class=\"hljs-comment\">--manifest https://bm4-pwa.angular-buch.com/manifest.json</span>\n</code></pre><p>Nutzen wir die Bubblewrap CLI zum ersten Mal, so werden wir in den ersten zwei Schritten nach den Verzeichnissen für das <a href=\"https://openjdk.java.net/\">Java OpenJDK</a> und das <a href=\"https://developer.android.com/studio\">AndroidSDK</a> gefragt.\nHier geben wir die Pfade zu den entsprechenden Verzeichnissen an.\nUnter macOS lauten sie zum Beispiel:</p>\n<pre><code class=\"language-bash\">? <span class=\"hljs-type\">Path</span> <span class=\"hljs-keyword\">to</span> the JDK: /Library/Java/JavaVirtualMachines/adoptopenjdk<span class=\"hljs-number\">-8.</span>jdk\n? <span class=\"hljs-type\">Path</span> <span class=\"hljs-keyword\">to</span> the Android SDK: /Users/my-<span class=\"hljs-keyword\">user</span>/Library/Android/sdk\n</code></pre><blockquote>\n<p>Diese Angaben werden für spätere Installationen in der Datei <code>~/.llama-pack/llama-pack-config.json</code> gespeichert und können bei Bedarf angepasst werden.</p>\n</blockquote>\n<p>Im nächsten Schritt liest die Bubblewrap CLI das Web App Manifest unserer PWA aus und stellt einige Fragen zu den Metadaten der App: Bezeichnung, hinterlegte Icons und Pfade.\nDiese Einstellungen werden in der Regel schon korrekt ausgelesen und müssen nicht manuell angepasst werden:</p>\n<pre><code class=\"language-bash\">init Fetching Manifest:  <span class=\"hljs-keyword\">https</span>://bm4-pwa.angular-buch.com/manifest.json\n? Domain being opened <span class=\"hljs-keyword\">in</span> <span class=\"hljs-keyword\">the</span> TWA: bm4-pwa.angular-buch.com\n? Name <span class=\"hljs-keyword\">of</span> <span class=\"hljs-keyword\">the</span> application: BookMonkey <span class=\"hljs-number\">4</span> PWA\n? Name <span class=\"hljs-built_in\">to</span> be shown <span class=\"hljs-keyword\">on</span> <span class=\"hljs-title\">the</span> <span class=\"hljs-title\">Android</span> <span class=\"hljs-title\">Launcher</span>: <span class=\"hljs-title\">BookMonkey</span>\n? Color <span class=\"hljs-built_in\">to</span> be used <span class=\"hljs-keyword\">for</span> <span class=\"hljs-keyword\">the</span> status bar: <span class=\"hljs-comment\">#DB2828</span>\n? Color <span class=\"hljs-built_in\">to</span> be used <span class=\"hljs-keyword\">for</span> <span class=\"hljs-keyword\">the</span> splash screen background: <span class=\"hljs-comment\">#FAFAFA</span>\n? Relative path <span class=\"hljs-built_in\">to</span> <span class=\"hljs-built_in\">open</span> <span class=\"hljs-keyword\">the</span> TWA: /\n? <span class=\"hljs-built_in\">URL</span> <span class=\"hljs-built_in\">to</span> <span class=\"hljs-keyword\">an</span> image that is <span class=\"hljs-keyword\">at</span> least <span class=\"hljs-number\">512</span>x512px: <span class=\"hljs-keyword\">https</span>://bm4-pwa.angular-buch.com/assets/icons/icon<span class=\"hljs-number\">-512</span>x512.png\n? <span class=\"hljs-built_in\">URL</span> <span class=\"hljs-built_in\">to</span> <span class=\"hljs-keyword\">an</span> image that is <span class=\"hljs-keyword\">at</span> least <span class=\"hljs-number\">512</span>x512px <span class=\"hljs-built_in\">to</span> be used when generating maskable icons undefined\n? Include app shortcuts?\n  Yes\n? Android Package Name (<span class=\"hljs-keyword\">or</span> Application ID): com.angular_buch.bm4_pwa.twa\n</code></pre><p>In der nächsten Abfrage müssen wir den Schlüssel zur Signierung der App angeben.\nHaben wir hier noch keinen Schlüssel erzeugt, werden wir darauf hingewiesen und können einen neuen Schlüssel anlegen.\nDafür müssen wir einige Infos zum Ersteller des Schlüssels hinterlegen.\nAußerdem müssen wir ein Passwort für den <em>Key Store</em> und eines für den einzelnen <em>Key</em> der Anwendung angeben.\nDieses benötigen wir später beim Build und beim Signieren der App erneut.</p>\n<pre><code class=\"language-bash\">? Location <span class=\"hljs-keyword\">of</span> <span class=\"hljs-keyword\">the</span> Signing Key: ./android.keystore\n? Key name: android\n...\n? Signing Key could <span class=\"hljs-keyword\">not</span> be found <span class=\"hljs-keyword\">at</span> <span class=\"hljs-string\">&quot;./android.keystore&quot;</span>. Do you want <span class=\"hljs-built_in\">to</span> <span class=\"hljs-built_in\">create</span> <span class=\"hljs-literal\">one</span> now? Yes\n? First <span class=\"hljs-keyword\">and</span> Last names (eg: John Doe): John Doe\n? Organizational Unit (eg: Engineering Dept): Engineering Dept\n? Organization (eg: Company Name): My Company\n? Country (<span class=\"hljs-number\">2</span> letter code): DE\n? Password <span class=\"hljs-keyword\">for</span> <span class=\"hljs-keyword\">the</span> Key Store: [hidden]\n? Password <span class=\"hljs-keyword\">for</span> <span class=\"hljs-keyword\">the</span> Key: [hidden]\nkeytool Signing Key created successfully\ninit\ninit Project generated successfully. Build <span class=\"hljs-keyword\">it</span> <span class=\"hljs-keyword\">by</span> running <span class=\"hljs-string\">&quot;@bubblewrap/cli build&quot;</span>\n</code></pre><p>Im Ergebnis sollten wir folgende Dateistruktur erhalten:</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/twa-bubblewrap.png\" alt=\"Dateistruktur nach Erzeugung der TWA mithilfe der Bubblewrap CLI\"></p>\n<p>Prinzipiell sind wir damit auch schon fertig.\nWir müssen nun noch die fertige Android-App (<code>*.apk</code>-Datei) erzeugen.</p>\n<p>Das Ergebnis der TWA-Generierung können Sie auch in folgendem Repository nachvollziehen:</p>\n<p><a href=\"https://github.com/book-monkey4/book-monkey4-pwa-twa-wrapper\">https://github.com/book-monkey4/book-monkey4-pwa-twa-wrapper</a></p>\n<h2 id=\"die-signierte-app-bauen\">Die signierte App bauen</h2>\n<p>Wir können unsere signierte Android-App entwerder direkt mithilfe der Bubblewrap CLI bauen, oder wir nutzen hierfür Android Studio.</p>\n<h3 id=\"mit-der-bublewrap-cli\">Mit der Bublewrap CLI</h3>\n<p>Wir rufen das <code>build</code>-Kommando der Bubblewrap CLI auf.\nHier müssen wir zunächst das von uns vergebene Passwort für den Key Store und anschließend das Passwort für den konkreten Key eingeben:</p>\n<pre><code class=\"language-bash\">npx @bubblewrap/cli build\n? KeyStore password: ********\n? Key password: ********\nbuild Building the Android<span class=\"hljs-params\">-App...</span>\nbuild Zip Aligning<span class=\"hljs-params\">...</span>\nbuild Checking PWA Quality Criteria<span class=\"hljs-params\">...</span>\nbuild\nbuild Check the <span class=\"hljs-literal\">full</span> PageSpeed Insights report at:\nbuild - https:<span class=\"hljs-comment\">//developers.google.com/speed/pagespeed/insights/?url=https%3A%2F%2Fbm4-pwa.angular-buch.com%2F</span>\nbuild\nbuild\nbuild Quality Criteria scores\nbuild Lighthouse Performance score: <span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span>. <span class=\"hljs-number\">80</span>\nbuild Lighthouse PWA check: <span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span> NO\nbuild\nbuild Web Vitals\nbuild Largest Contentful Paint (LCP) <span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span> <span class=\"hljs-number\">3.7</span> s\nbuild Maximum Potential First Input Delay (<span class=\"hljs-keyword\">Max</span> FID) <span class=\"hljs-params\">...</span> <span class=\"hljs-number\">391</span> ms\nbuild Cumulative Layout Shift (CLS) <span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span>. <span class=\"hljs-number\">0.00</span>\nbuild\nbuild Other scores\nbuild Lighthouse Accessibility score<span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span>. <span class=\"hljs-number\">67</span>\nbuild\nbuild Summary\nbuild Overall result: <span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span><span class=\"hljs-params\">...</span> <span class=\"hljs-keyword\">FAIL</span>\nbuild WARNING PWA Quality Criteria check failed.\nbuild Signing<span class=\"hljs-params\">...</span>\nbuild Signed Android<span class=\"hljs-params\">-App</span> generated at <span class=\"hljs-string\">&quot;./app-release-signed.apk&quot;</span>\nbuild Digital Asset Links file generated at ./assetlinks.json\nbuild Read more about setting up Digital Asset Links at https:<span class=\"hljs-comment\">//developers.google.com/web/android/trusted-web-activity/quick-start#creating-your-asset-link-file</span>\n</code></pre><p>Wenn wir keinen Fehler erhalten, sollte sich die fertige signierte App im Hauptverzeichnis befinden und <code>app-release-signed.apk</code> heißen.</p>\n<p>Vereinzelt kann es dazu kommen, dass wir eine Fehlermeldung wie die folgende erhalten:</p>\n<pre><code>UnhandledPromiseRejectionWarning: Error: <span class=\"hljs-built_in\">Error</span> calling the PageSpeed Insights API: Error: Failed <span class=\"hljs-keyword\">to</span> <span class=\"hljs-built_in\">run</span> the PageSpeed Insight report\n</code></pre><p>In diesem Fall schlägt die Analyse der App fehl, weil beispielsweise die Website gerade nicht erreichbar ist. Wir können den Build erneut aufrufen und das Flag <code>--skipPwaValidation</code> verwenden, um die Überprüfung der PWA zu überspringen.</p>\n<pre><code class=\"language-bash\">npx @bubblewrap/cli <span class=\"hljs-keyword\">build</span> --skipPwaValidation\n? KeyStore <span class=\"hljs-keyword\">password</span>: ********\n? <span class=\"hljs-keyword\">Key</span> <span class=\"hljs-keyword\">password</span>: ********\n<span class=\"hljs-keyword\">build</span> Building the Android-App...\n<span class=\"hljs-keyword\">build</span> Zip Aligning...\n<span class=\"hljs-keyword\">build</span> Signing...\n<span class=\"hljs-keyword\">build</span> Signed Android-App generated at <span class=\"hljs-string\">&quot;./app-release-signed.apk&quot;</span>\n<span class=\"hljs-keyword\">build</span> Digital Asset Links file generated at ./assetlinks.json\n<span class=\"hljs-keyword\">build</span> Read more about setting up Digital Asset Links at https://developers.google.com/web/android/trusted-web-activity/quick-<span class=\"hljs-keyword\">start</span>#creating-your-asset-link-file\n</code></pre><p>Kommt es zu dem nachfolgenden Fehler, prüfen Sie bitte den Pfad unter <code>jdkPath</code> in der Datei <code>~/.llama-pack/llama-pack-config.json</code>.\nDieser sollte auf das lokale Hauptverzeichnis des Java JDK 8 zeigen.\nAlternativ können Sie den Build mithilfe von Android Studio anstoßen.</p>\n<pre><code class=\"language-bash\">cli ERROR Command failed: <span class=\"hljs-string\">./gradlew</span> assembleRelease <span class=\"hljs-params\">--stacktrace</span>\n</code></pre><h3 id=\"mithilfe-von-android-studio\">Mithilfe von Android Studio</h3>\n<p>Bei dieser Variante öffnen wir zunächst das Projektverzeichnis in Android Studio.\nNun warten wir ab, bis der automatische Gradle-Build nach dem Öffnen des Projekts durchgelaufen ist.\nDen Fortschritt können wir unten rechts in Android Studio betrachten.\nAnschließend klicken wür im Menü <em>&quot;Build&quot;</em> auf <em>&quot;Generate Signed Bundle / APK&quot;</em>.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/android-studio-generate-signed-apk.png\" alt=\"Android Studio: Signierte APK erstellen\"></p>\n<p>Wir wählen hier den Punkt <em>&quot;APK&quot;</em> aus und klicken auf <em>&quot;Next&quot;</em>.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/android-studio-generate-signed-apk2.png\" alt=\"Android Studio: Signierte APK erstellen\"></p>\n<p>Im nächsten Schritt wählen wir den erstellten Keystore (<code>android.keystore</code>) aus dem Projektverzeichnis aus und geben das festgelegte Passwort ein.\nAlternativ können wir auch einen neuen Keystore erstellen.\nAnschließend können wir aus dem Keystore den <em>&quot;Key alias&quot;</em> auswählen (<code>android</code>).\nAuch hier müssen wir das Passwort eingeben, das wir zuvor für den konkreten Key vergeben haben.\nHaben wir alle Angaben korrekt getätigt, gehen wir weiter mit <em>&quot;Next&quot;</em>.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/android-studio-generate-signed-apk3.png\" alt=\"Android Studio: Signierte APK erstellen\"></p>\n<p>Im nächsten Schritt wählen wir als Build-Variante <em>release</em> aus und setzen die beiden Checkboxen bei <em>&quot;V1 (Jar Signature)&quot;</em> und <em>&quot;V2 (Full APK Signature)&quot;</em>.\nAnschließend können wir die Erzeugung mit <em>&quot;Finish&quot;</em> starten.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/android-studio-generate-signed-apk3.png\" alt=\"Android Studio: Signierte APK erstellen\"></p>\n<p>Die erzeugte APK befindet sich nun unter <code>./app/release/app-release.apk</code>.</p>\n<blockquote>\n<p>Kommt es beim Erzeugen der signierten APK zu einem Fehler, kann dies ggf. an einem defekten/falschen Keystore liegen. Versuchen Sie in diesem Fall, einen neuen Keystore während der vorherigen Schritte zu erzeugen.</p>\n</blockquote>\n<h2 id=\"die-app-über-die-google-play-console-veröffentlichen\">Die App über die Google Play Console veröffentlichen</h2>\n<p>Im letzten Schritt müssen wir unsere signierte und erzeugte Android-App noch bereitstellen und veröffentlichen.\nDazu gehen wir in der Google Play Console in das Menü <em>&quot;Test&quot;</em> &gt; <em>&quot;Offene Tests&quot;</em> und öffnen unser zuvor bereits vorbereitetes Release im Abschnitt <em>&quot;Releases</em>&quot;, welches im Status <em>&quot;Entwurf&quot;</em> ist durch Klick auf den Button <em>&quot;Bearbeiten&quot;</em>.</p>\n<p>Im nächsten Schritt können wir nun die zuvor erzeugte APK-Datei hochladen.\nWeiterhin geben wir eine Versionsnummer und eine Beschreibung zum Release an.\nHaben wir alles ausgefüllt, klicken wir auf <em>&quot;Überprüfen&quot;</em>.</p>\n<!-- TODO: @JohannesHoppe ab hier weiter :) (Text und Screenshots anpassen) -->\n\n<p>Jetzt haben wir es fast geschafft:\nDas Beta-Release wurde erstellt.\nAuf der nächsten Seite können wir die App nun veröffentlichen.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-beta-release.png\" alt=\"Google Play Console: Das Beta-Release veröffentlichen\"></p>\n<p>Haben wir diesen Schritt erledigt, ändert sich unser Menü auf der linken Seite ein wenig, und wir können unter <em>&quot;Übersicht&quot;</em> den aktuellen Status zur Veröffentlichung der Android-App einsehen.\nBis die App tatsächlich veröffentlicht und freigegeben wird, können ggf. ein paar Tage vergehen.</p>\n<p><img src=\"%%MARKDOWN_BASE_URL%%/blog/2020-11-twa/play-release-overview.png\" alt=\"Google Play Console: Übersicht mit Veröffentlichungsstatus\"></p>\n<p>Geschafft! Wir haben nun erfolgreich unsere Angular-PWA in eine Android-App integriert und sie im Google Play Store veröffentlicht.\nDabei haben wir das Konzept der Trusted Web Activity (TWA) genutzt.\nNun müssen wir nur noch auf die Freigabe warten, und wir können unsere App im Store finden und installieren.</p>\n<!-- TODO: @JohannesHoppe Bild von veröffentlichter App in Play Store -->\n\n<p><strong>Viel Spaß wünschen\nJohannes, Danny und Ferdinand</strong></p>\n","meta":{"title":"Trusted Web Activitys (TWA) mit Angular","author":"Danny Koppenhagen","mail":"mail@d-koppenhagen.de","published":"2020-11-17T00:00:00.000Z","lastModified":"2020-11-17T00:00:00.000Z","keywords":["TWA","Trusted Web Activity","PWA","Progressive Web App","Angular","Android","Android Store"],"language":"de","header":{"url":"header-twa.jpg","width":1920,"height":1171},"sticky":false,"hidden":false,"darkenHeader":false}}
