{"slug":"2019-12-docker0-intro","html":"<p><strong>Warum Sie Docker nutzen sollten, um neue Versionen Ihrer Angular-App jederzeit problemlos bauen, deployen und auch in mehreren Versionen parallel zueinander betreiben zu können.\nDies ist der Start unserer vierteiligen Artikelserie von unserem Gastautor Michael Kaaden.</strong></p>\n<p>Inhaltsverzeichnis:</p>\n<ul>\n<li><a href=\"/blog/2019-12-docker0-intro#prinzipielles-deployment\">Prinzipielles Deployment</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#problemstellung\">Problemstellung</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#die-beispiel-app\">Die Beispiel-App</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#grundsaetzliches-zu-docker\">Grundsätzliches zu Docker</a><ul>\n<li><a href=\"/blog/2019-12-docker0-intro#images-und-container\">Images und Container</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#portabilitaet\">Portabilität</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#isoliert-schnell-und-ressourcenschonend\">Isoliert, schnell und ressourcenschonend</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#docker-registrys\">Docker Registrys</a></li>\n<li><a href=\"/blog/2019-12-docker0-intro#loesungsskizze\">Lösungsskizze</a></li>\n</ul>\n</li>\n<li><a href=\"/blog/2019-12-docker0-intro#ausblick\">Ausblick</a></li>\n</ul>\n<p>Es ist soweit: Die Angular-App, die Sie Dank der zweiten Auflage des famosen Angular-Buchs erstellt haben, ist fertig!\nDie Unit- und End-to-End-Tests leuchten tiefgrün.\nDie Testabdeckung liegt nahe 100 Prozent. Auf Ihrem Entwicklungssystem läuft die App perfekt.\nJetzt müssen Sie sie nur noch auf Ihrem extern verfügbaren Webserver zum Laufen bringen und die Begeisterungsstürme Ihrer Nutzer abwarten.</p>\n<h2 id=\"prinzipielles-deployment\">Prinzipielles Deployment</h2>\n<p>Im Prinzip ist es dank der <a href=\"https://cli.angular.io/\">Angular CLI</a> sehr einfach, eine für den Produktivmodus geeignete Version Ihrer App zu erzeugen: Sie rufen lediglich <code>ng build --prod</code> auf und kopieren anschließend den Inhalt des Verzeichnisses <code>dist/&lt;app-name&gt;</code> auf den Rechner, auf dem der Webserver läuft.\nIm Webserver – sei es ein Apache, nginx oder was auch immer – tragen Sie dann den Verzeichnispfad ein, unter dem sie die App abgelegt haben, und sorgen dafür, dass jede Anfrage auf <code>index.html</code> gemappt wird.</p>\n<h2 id=\"problemstellung\">Problemstellung</h2>\n<p>In naher Zukunft werden Sie Bugs in der App fixen und neue Features einbauen.\nJedes Mal werden Sie deswegen eine neue Version Ihrer App erstellen müssen.\nWie können Sie sicherstellen, dass die jeweils passende Version ihren Weg auf den Webserver findet?</p>\n<p>Vielleicht erstellen Sie die App ja auch im Kundenauftrag im Rahmen eines agilen Entwicklungsprozesses.\nDer Kunde will dann nicht nur die jeweils aktuelle Version Ihrer App nutzen, sondern auch den jeweils aktuellen Arbeitsstand begutachten können, um frühzeitig Rückmeldung zu in Entwicklung befindlichen Features geben zu können.\nLetzteren werden Sie täglich erweitern, beide Stände evtl. durch Bugfixes pflegen müssen.\nWie stellen Sie sicher, dass Sie in der Hektik des Entwickleralltags nicht vergessen, den jeweils neuesten Stand einzuspielen?\nUnd wie gehen Sie damit um, wenn im Produktivstand ein Fehler durchgeschlüpft ist, Ihre Entwicklungsmaschine aber gerade wegen eines Festplattenschadens nicht verfügbar ist, um den Fehler zu beheben?</p>\n<p>In diesem und den folgenden Blog-Artikeln möchte ich Ihnen zeigen, wie Sie mit diesen Problemstellungen bestmöglich umgehen können.</p>\n<h2 id=\"die-beispiel-app\">Die Beispiel-App</h2>\n<p>Als Beispiel soll uns über die Artikel hinweg eine ganz einfache App dienen: Sie besteht aus zwei Komponenten, zwischen denen wir mittels Routing wechseln können. Die eine Komponente zeigt eine &quot;1&quot; an, die andere eine &quot;2&quot;. Sinn dessen ist, zu zeigen, dass die App samt Routing auch nach einem Reload in Ihrem Browser noch funktioniert. Setzen Sie Ihren Webserver nämlich falsch auf, wird das zu einer Fehlermeldung führen.</p>\n<p>Diese App bleibt aus der Perspektive des Nutzers über die ganze Artikelserie hinweg identisch. Tatsächlich werden wir sie, wo nötig, erweitern, um den Erfordernissen zu genügen. Sie finden die App auf <a href=\"https://github.com/MichaelKaaden/dockerized-app\">GitHub</a>. Die <code>Part-...</code>-Verzeichnisse entsprechen den jeweiligen Teilen dieser Serie.</p>\n<h2 id=\"grundsätzliches-zu-docker-\">Grundsätzliches zu Docker <a name=\"grundsaetzliches-zu-docker\"></a></h2>\n<p>Falls Sie mit Docker noch nichts zu tun haben, teasere ich in diesem Abschnitt kurz einige der Vorteile von Docker an, um bereits die Lösung für die o. g. Fragen zu skizzieren.\nIch werde hier jedoch keine Docker-Konzepte vorstellen.\nEine erste (englischsprachige) Einführung bietet z. B. das <a href=\"https://docs.docker.com/get-started/\">Docker Get Started Tutorial</a>.</p>\n<p>Bei Docker handelt es sich um nichts anderes als eine extrem leichtgewichtige Virtualisierungslösung, die lediglich den Prozess mit der Software virtualisiert, die Sie nutzen wollen.\nAndere Lösungen wie VirtualBox oder VMware emulieren einen ganzen Rechner, darauf ein Betriebssystem und erst darin die Software.</p>\n<h3 id=\"images-und-container\">Images und Container</h3>\n<p>Docker erstellt sog. <em>Images</em>, die eine Software wie die Angular-App und die notwendigen Abhängigkeiten wie den Webserver und dessen Abhängigkeiten enthalten.\nZur Laufzeit werden Images in <em>Container</em> instanziiert, die jeweils einem Prozess entsprechen.\nSomit verhält sich ein Container zu einem Image wie eine Instanz zu einer Klasse in gängigen objektorientierten Programmiersprachen.</p>\n<h3 id=\"portabilität-\">Portabilität <a name=\"portabilitaet\"></a></h3>\n<p>Da ein Docker-Container seine eigene Umgebung vollständig mitbringt, können Sie eine Software, die etwa ein Debian-Linux benötigt, problemlos auf Windows laufen lassen. Container sind somit portabel und benötigen auf dem Hostsystem nur die Docker-Software.</p>\n<h3 id=\"isoliert-schnell-und-ressourcenschonend\">Isoliert, schnell und ressourcenschonend</h3>\n<p>Docker nutzt Linux-Basismechanismen, um einzelne Prozesse mitsamt ihrer Abhängigkeiten wie Libraries zu kapseln und isoliert vom Rest des Systems auf dem Kernel des Wirtssystems zur Ausführung zu bringen.\nSomit benötigt ein Docker-Container nur unwesentlich mehr Ressourcen als ein nativer Prozess: Es kommen lediglich einige Verwaltungsstrukturen hinzu, außerdem läuft der Netzwerkverkehr des Containers etwas verschlungenere Wege, um die Kommunikation begrenzen und in ein virtuelles Netzwerk verlagern zu können.\nSoftware in einem Docker-Container läuft dadurch fast genauso schnell und mit fast gleichem Ressourcenverbrauch wie im nativen Betrieb.\nSie können somit dutzende oder hunderte von Containern auf einem handelsüblichen Rechner betreiben.</p>\n<img src=\"%%MARKDOWN_BASE_URL%%/blog/2019-12-docker0-intro/docker-vm.png\" alt=\"Docker-Virtualisierung\" width=\"50%\">  \n<small>Quelle:\n[https://docs.docker.com/get-started/](https://docs.docker.com/get-started/)</small>\n\n<h3 id=\"docker-registrys\">Docker Registrys</h3>\n<p>Docker-Images können über sog. <em>Docker Registrys</em> verteilt werden.\nDas können öffentliche wie der <a href=\"https://hub.docker.com/\">Docker Hub</a> oder auch private in Ihrem lokalen Netz sein.\nDie Installation ist extrem einfach, denn auch die Registry kommt als Docker-Image auf Ihren Rechner.</p>\n<p>Sie können Images über eine Registry in Ihrem Netzwerk verteilen:\nRechner A, sei es Ihr Entwicklerrechner oder ein Build Server, baut ein Docker-Image und schiebt dieses in die Registry.\nRechner B, Ihr Webserver, holt sich das jeweils neueste Image von der Registry und startet damit den Container neu.\nSchon haben Sie eine neue Version Ihrer App zum Laufen gebracht.</p>\n<p>Wenn Sie mehr zu dem Thema erfahren wollen, so empfehle ich Ihnen einen Blick in die offizielle Dokumentation zur <a href=\"https://docs.docker.com/registry/\">Docker Registry</a> zu werfen.\nDiese ermöglicht es Ihnen, Ihre selbstgebauten Images zu hosten.</p>\n<h3 id=\"lösungsskizze-\">Lösungsskizze <a name=\"loesungsskizze\"></a></h3>\n<p>Weiter oben habe ich schon die Problematik angedeutet, dass Sie ständig neue Versionen Ihrer App auf Ihren Webserver aufspielen müssen.\nWenn Sie bei jedem Commit in Ihrem Versionsverwaltungssystem automatisiert ein neues Docker-Image erzeugen und dieses von Ihrem Webserver aus holen und zur Ausführung bringen, brauchen Sie sich keine Gedanken mehr darüber zu machen, wie und wo Sie Ihre App bereitstellen.</p>\n<p>Jedes Image kann mit sog. <em>Tags</em> versehen werden.\nDiese zeichnen Images mit Metadaten wie z. B. dem Zeitpunkt des Builds, dem Namen des aktuellen Entwicklungszweigs oder der Versionsnummer Ihrer Software aus.\nDadurch haben Sie nicht nur die Möglichkeit, mehrere Stände parallel bereitzuhalten, sondern Sie haben Ihre Images gleichzeitig auch versioniert vorliegen und können problemlos ein beliebiges Image aus der Versionshistorie zur Ausführung bringen.</p>\n<p>Sie sehen, dass Docker viele Probleme löst, über die Sie früher oder später stolpern würden.</p>\n<p>Für den Rest der Artikelserie gehe ich davon aus, dass Docker auf Ihrem System einwandfrei funktioniert.\nWie Sie das prüfen können, zeigt der o. g. <a href=\"https://docs.docker.com/get-started/#test-docker-installation\"><em>Getting Started Guide</em></a>.</p>\n<h2 id=\"ausblick\">Ausblick</h2>\n<p>Ich werde Ihnen in drei weiteren Artikeln die wichtigsten Punkte zu Angular mit Docker vermitteln.\nNach jedem Advent veröffentliche ich hierzu einen neuen Artikel.\nDie Artikelserie besteht aus den folgenden Teilen:</p>\n<ol>\n<li><a href=\"https://angular-buch.com/blog/2019-12-docker0-intro\">Angular-Apps und Docker: Einleitung</a> <strong>(der aktuelle Artikel)</strong></li>\n<li><a href=\"https://angular-buch.com/blog/2019-12-docker1-simple-case\">Angular-App über Docker bereitstellen</a></li>\n<li><a href=\"https://angular-buch.com/blog/2019-12-docker2-build-once-run-anywhere\">Build Once, Run Anywhere oder: Konfiguration über Docker verwalten</a></li>\n<li><a href=\"https://angular-buch.com/blog/2019-12-docker3-multi-stage-build\">Multi-Stage Builds oder: Immer die Build-Umgebung dabei haben</a></li>\n</ol>\n<br>\n<hr>\n\n<p><small><strong>Titelbild:</strong> Bild von <a href=\"https://pixabay.com/de/users/Thomas_G-7083/\">Thomas G.</a> auf <a href=\"https://pixabay.com/de/\">Pixabay</a>, bearbeitet</small></p>\n","meta":{"title":"[Docker Serie 1/4] Angular-Apps und Docker: Einleitung","author":"Michael Kaaden","mail":"blog@kaaden.net","bio":"Michael Kaaden ist als Software-Architekt und Manager für ein mittelständisches Unternehmen in Nürnberg tätig. Dort ist er für die technische Seite einer Cloud-Produktline verantwortlich. In dieser Eigenschaft kümmert er sich trotz seiner grundsätzlichen Affinität zu Angular nicht nur um Frontends, sondern neben der Gesamtarchitektur unter anderem auch um APIs, Backends, Datenbanken sowie Software-Entwicklungs- und Build-Prozesse. Wenn er in seiner Freizeit nicht gerade mit seiner Familie unterwegs ist, Full-Stack Developer spielt oder seine Nase in neue Technologien steckt, versucht er, seinen Laufstil zu verbessern und endlich den für ihn perfekten Fotoapparat zu finden.","published":"2019-12-02T00:00:00.000Z","keywords":["Docker","Deployment"],"language":"de","header":{"url":"header0.jpg","width":1920,"height":1238},"hidden":false,"sticky":false,"darkenHeader":false}}
