{"slug":"2019-06-das-neue-buch","html":"<p><strong>Das neue deutschsprachige Angular-Buch ist da!</strong><br>Ab sofort ist die 2. Auflage des erfolgreichen Standardwerks im Handel verfügbar.</p>\n<p>Mit der neuen Ausgabe erwarten Sie 740 Seiten mit aktuellem Inhalt zum Webframework Angular.\nDie neue Ausgabe wurde grundlegend aktualisiert und erweitert.\nAlle Inhalte und Beispiele sind auf dem Stand der aktuellen Angular-Version 8 und wurden an etablierte Best Practices angepasst.\nDabei wurden große Teile des Buchs vollständig überarbeitet und neu strukturiert.</p>\n<p>Zusätzlich wurden neue Themen in das Buch aufgenommen, sodass es seiner Rolle als Standardwerk gerecht werden kann.\nIm <a href=\"/blog/2019-06-changelog-zweite-auflage\">Changelog zur zweiten Auflage</a> erhalten Sie einen Überblick über die Änderungen und Erweiterungen.\nAuch für die Leser der ersten Auflage lohnt sich der Umstieg.</p>\n<p>Das Buch ist zum Preis von 36,90 EUR in jeder gut sortierten Buchhandlung und im Online-Handel erhältlich – zum Beispiel direkt beim <a href=\"https://www.dpunkt.de/buecher/13231/9783864906466-angular.html\">dpunkt.verlag</a> oder bei <a href=\"https://amzn.to/2Wuo7cd\">Amazon</a>.</p>\n<div class=\"row\">\n  <div class=\"col-4\">\n    <img src=\"https://website-articles.angular-buch.com/2019-06-das-neue-buch/buch700/IMG_9862.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"https://website-articles.angular-buch.com/2019-06-das-neue-buch/buch700/IMG_9855.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"https://website-articles.angular-buch.com/2019-06-das-neue-buch/buch700/IMG_9867.jpg\" alt=\"\">\n  </div>\n</div>\n\n<h2 id=\"fundierter-einstieg-in-angular\">Fundierter Einstieg in Angular</h2>\n<p>Lernen Sie die Grundlagen, fortgeschrittene Themen und Best Practices zu Angular mit diesem Praxisbuch!\nMit einem <a href=\"https://book-monkey3.angular-buch.com/\">zusammenhängenden Beispielprojekt</a> führen wir Sie durch die Welt von Angular.\nLernen Sie Schritt für Schritt, wie Sie modulare Single-Page-Anwendungen entwickeln.\nPraktisch: Der Programmcode zu jeder einzelnen Entwicklungsphase ist <a href=\"https://github.com/angular-buch/book-monkey3\">auf GitHub</a> verfügbar.\nSo können Sie alle Schritte gut nachvollziehen und auch Teile überspringen.</p>\n<p>Neben den Grundlagen werden auch behandelt:</p>\n<ul>\n<li>Reaktive Programmierung mit RxJS</li>\n<li>State-Management mit Redux/NgRx</li>\n<li>Testing mit Jasmine, Karma und Protractor</li>\n<li>Routing und Modulsystem</li>\n<li>HTTP und Interceptoren</li>\n<li>Formularverarbeitung</li>\n<li>Dependency Injection und Services</li>\n<li>Internationalisierung (i18n)</li>\n<li>Mobile Anwendungen mit NativeScript</li>\n<li>Server-Side Rendering</li>\n<li>und vieles mehr</li>\n</ul>\n<p>Das Buch setzt Vorkenntnisse in JavaScript, HTML und CSS voraus.\nWer noch nicht mit TypeScript vertraut ist, findet im Buch eine kompakte Einführung.</p>\n<h2 id=\"hintergrund\">Hintergrund</h2>\n<p>Die erste Auflage des deutschen Angular-Buchs aus dem dpunkt.verlag erschien im Mai 2017 im Handel.\nDas Buch war durchweg auf dem Stand von Angular 4.\nEin Technologiebuch befindet sich stets in einem Spannungsfeld:\nEinerseits ist ein gedrucktes Buch für Beständigkeit über mehrere Jahre ausgelegt, andererseits muss ein Enterprise-Framework wie Angular schnell beweglich sein, um mit dem technologischen Fortschritt mitzuhalten.</p>\n<p>Wir haben deshalb regelmäßig in <a href=\"/updates\">Blogartikeln</a> über neue Features und Änderungen informiert.\nDie grundsätzlichen Schnittstellen des Frameworks blieben beständig, allerdings waren einige Breaking Changes unvermeidbar.\nZwei Jahre nach dem Erscheinen der ersten Auflage waren so viele Änderungen geschehen, dass eine zweite Auflage ratsam wurde.</p>\n<p>Im Sommer 2018 begannen wir die Arbeit an der neuen Auflage.\nDabei haben wir einen guten Kompromiss zwischen einer reinen Aktualisierung und einer vollständigen Neuauflage gefunden.\nEinige Inhalte sind komplett neu, andere Kapitel haben wir vollständig gelöscht und neu aufgerollt.\nDas Leser-Feedback der letzten zwei Jahre wurde ebenso berücksichtigt, und es wurden viele unklare Stellen des ersten Buchs vereinfacht.\nAbschließend kann man sagen, dass jeder Abschnitt im Buch mehr oder weniger stark angepasst wurde.\nDas neue Angular-Buch bewegt sich damit wieder am Puls der Zeit und sollte auch in zwei Jahren noch genug Aktualität besitzen.</p>\n<p>Wir wünschen Ihnen viel Spaß beim Lesen!\nSollten Sie Feedback, Anmerkungen oder Fragen haben, zögern Sie nicht, uns zu schreiben!\nWir sind per Mail unter <a href=\"mailto:team@angular-buch.com\">team@angular-buch.com</a> oder <a href=\"https://twitter.com/angular_buch\">Twitter</a> für Sie da.</p>\n<p>Mit besten Grüßen –\ndas Autorenteam<br>\n<strong>Ferdinand Malcher, Johannes Hoppe und Danny Koppenhagen</strong></p>\n<div class=\"row\">\n  <div class=\"col-4\">\n    <img src=\"https://website-articles.angular-buch.com/2019-06-das-neue-buch/buch700/IMG_9853.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"https://website-articles.angular-buch.com/2019-06-das-neue-buch/buch700/IMG_9868.jpg\" alt=\"\">\n  </div>\n  <div class=\"col-4\">\n    <img src=\"https://website-articles.angular-buch.com/2019-06-das-neue-buch/buch700/IMG_9864.jpg\" alt=\"\">\n  </div>\n</div>\n\n\n<h2 id=\"danksagung\">Danksagung</h2>\n<p>Dieses Buch hätte nicht seine Reife erreicht ohne die Hilfe und Unterstützung verschiedener Menschen.\nWir danken <strong>Gregor Woiwode</strong> für die Mitwirkung als Autor in der ersten Auflage.\nBesonderer Dank geht an <strong>Michael Kaaden</strong> für seine unermüdlichen Anregungen und kritischen Nachfragen.\nMichael hat das gesamte Buch mehrfach auf Verständlichkeit und Fehler abgeklopft, alle Codebeispiele nachvollzogen und viel wertvollen Input geliefert.\nEr hat zudem maßgeblich am Docker-Beispiel mitgewirkt.\n<strong>Matthias Jauernig</strong>, <strong>Dilyana Pavlova</strong>, <strong>Silvio Böhme</strong>, <strong>Danilo Hoffmann</strong> und <strong>Jan-Niklas Wortmann</strong> danken wir ebenso für die hilfreichen Anregungen und Korrekturvorschläge zur zweiten Auflage.\n<strong>Julian Steiner</strong> hat uns mit seiner Expertise zu NativeScript bei der Entwicklung der BookMonkey-Mobile-App unterstützt.\nWertvolles Feedback zur ersten Auflage dieses Buchs haben uns außerdem\n<strong>Nils Frohne</strong>,\n<strong>Johannes Hamfler</strong>,\n<strong>Stephan Hartmann</strong>,\n<strong>Johannes Hofmeister</strong>,\n<strong>Alexander Szczepanski</strong> und\n<strong>Daniel Vladut</strong> zukommen lassen.</p>\n<p>Dem Team vom dpunkt.verlag, insbesondere <strong>René Schönfeldt</strong> und <strong>Sabrina Dietze</strong>, danken wir für die persönliche Unterstützung und die guten Anregungen zum Buch.\nAußerdem danken wir dem <strong>Angular-Team</strong> und der Community dafür, dass sie eine großartige Plattform geschaffen haben, die uns den Entwickleralltag angenehmer macht.</p>\n","meta":{"title":"Das neue Angular-Buch ist da!","author":"Angular Buch Team","mail":"team@angular-buch.com","published":"2019-06-14T00:00:00.000Z","lastModified":"2019-06-14T00:00:00.000Z","keywords":["Angular","Buch","Release","Buchhandel","Zweite Auflage"],"language":"de","header":{"url":"buchblogheader2.png","width":2000,"height":697}}}
